Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x11ef (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 33 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2cd74): GNU C++20 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu++20 -ffunction-sections -fdata-sections -fno-exceptions -fno-rtti -fno-use-cxa-atexit -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 33	(C++14)
    <12>   DW_AT_name        : (indirect string, offset: 0x6fee6): ../Application/ControlnDDisplayTask.cpp
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x46427): F:/haseeb/liquidMeasuringProject/Inverter_Nd_LiquidMeas/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4dede): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2d0ac): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x19c45): unsigned char
 <1><44>: Abbrev Number: 7 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x7531e): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x80d70): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 7 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x9783c): short unsigned int
 <1><5e>: Abbrev Number: 7 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xcef7): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x631f6): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 7 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x2fe1f): long unsigned int
 <1><78>: Abbrev Number: 7 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x46c35): long long int
 <1><7f>: Abbrev Number: 7 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x202c4): long long unsigned int
 <1><86>: Abbrev Number: 34 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 7 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xc845): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2d0ae): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 12 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x72690): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 5 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x71d49): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 5 (DW_TAG_typedef)
    <c8>   DW_AT_name        : (indirect string, offset: 0x84005): size_t
    <cc>   DW_AT_decl_file   : 4
    <cd>   DW_AT_decl_line   : 214
    <ce>   DW_AT_decl_column : 23
    <cf>   DW_AT_type        : <0x8d>
 <1><d3>: Abbrev Number: 7 (DW_TAG_base_type)
    <d4>   DW_AT_byte_size   : 8
    <d5>   DW_AT_encoding    : 4	(float)
    <d6>   DW_AT_name        : (indirect string, offset: 0x81830): long double
 <1><da>: Abbrev Number: 35 (DW_TAG_unspecified_type)
    <db>   DW_AT_name        : (indirect string, offset: 0x5cd1f): decltype(nullptr)
 <1><df>: Abbrev Number: 36 (DW_TAG_pointer_type)
    <e0>   DW_AT_byte_size   : 4
 <1><e1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e2>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 37 (DW_TAG_subroutine_type)
 <1><e7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e8>   DW_AT_byte_size   : 4
    <e8>   DW_AT_type        : <0xec>
 <1><ec>: Abbrev Number: 7 (DW_TAG_base_type)
    <ed>   DW_AT_byte_size   : 1
    <ee>   DW_AT_encoding    : 8	(unsigned char)
    <ef>   DW_AT_name        : (indirect string, offset: 0x3246a): char
 <1><f3>: Abbrev Number: 12 (DW_TAG_const_type)
    <f4>   DW_AT_type        : <0xec>
 <1><f8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f9>   DW_AT_byte_size   : 4
    <f9>   DW_AT_type        : <0xf3>
 <1><fd>: Abbrev Number: 11 (DW_TAG_structure_type)
    <fe>   DW_AT_byte_size   : 80
    <ff>   DW_AT_decl_file   : 5
    <100>   DW_AT_decl_line   : 152
    <101>   DW_AT_decl_column : 1
    <101>   DW_AT_linkage_name: (indirect string, offset: 0x91354): 11ADC_TypeDef
    <105>   DW_AT_sibling     : <0x20c>
 <2><109>: Abbrev Number: 10 (DW_TAG_member)
    <10a>   DW_AT_name        : SR
    <10d>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 153
    <10f>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xc2>
    <114>   DW_AT_data_member_location: 0
 <2><115>: Abbrev Number: 10 (DW_TAG_member)
    <116>   DW_AT_name        : CR1
    <11a>   DW_AT_decl_file   : 5
    <11b>   DW_AT_decl_line   : 154
    <11c>   DW_AT_decl_column : 17
    <11d>   DW_AT_type        : <0xc2>
    <121>   DW_AT_data_member_location: 4
 <2><122>: Abbrev Number: 10 (DW_TAG_member)
    <123>   DW_AT_name        : CR2
    <127>   DW_AT_decl_file   : 5
    <128>   DW_AT_decl_line   : 155
    <129>   DW_AT_decl_column : 17
    <12a>   DW_AT_type        : <0xc2>
    <12e>   DW_AT_data_member_location: 8
 <2><12f>: Abbrev Number: 1 (DW_TAG_member)
    <130>   DW_AT_name        : (indirect string, offset: 0x8de90): SMPR1
    <134>   DW_AT_decl_file   : 5
    <135>   DW_AT_decl_line   : 156
    <136>   DW_AT_decl_column : 17
    <137>   DW_AT_type        : <0xc2>
    <13b>   DW_AT_data_member_location: 12
 <2><13c>: Abbrev Number: 1 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0x37a13): SMPR2
    <141>   DW_AT_decl_file   : 5
    <142>   DW_AT_decl_line   : 157
    <143>   DW_AT_decl_column : 17
    <144>   DW_AT_type        : <0xc2>
    <148>   DW_AT_data_member_location: 16
 <2><149>: Abbrev Number: 1 (DW_TAG_member)
    <14a>   DW_AT_name        : (indirect string, offset: 0x35e1b): JOFR1
    <14e>   DW_AT_decl_file   : 5
    <14f>   DW_AT_decl_line   : 158
    <150>   DW_AT_decl_column : 17
    <151>   DW_AT_type        : <0xc2>
    <155>   DW_AT_data_member_location: 20
 <2><156>: Abbrev Number: 1 (DW_TAG_member)
    <157>   DW_AT_name        : (indirect string, offset: 0x35e21): JOFR2
    <15b>   DW_AT_decl_file   : 5
    <15c>   DW_AT_decl_line   : 159
    <15d>   DW_AT_decl_column : 17
    <15e>   DW_AT_type        : <0xc2>
    <162>   DW_AT_data_member_location: 24
 <2><163>: Abbrev Number: 1 (DW_TAG_member)
    <164>   DW_AT_name        : (indirect string, offset: 0x35e27): JOFR3
    <168>   DW_AT_decl_file   : 5
    <169>   DW_AT_decl_line   : 160
    <16a>   DW_AT_decl_column : 17
    <16b>   DW_AT_type        : <0xc2>
    <16f>   DW_AT_data_member_location: 28
 <2><170>: Abbrev Number: 1 (DW_TAG_member)
    <171>   DW_AT_name        : (indirect string, offset: 0x35e2d): JOFR4
    <175>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 161
    <177>   DW_AT_decl_column : 17
    <178>   DW_AT_type        : <0xc2>
    <17c>   DW_AT_data_member_location: 32
 <2><17d>: Abbrev Number: 10 (DW_TAG_member)
    <17e>   DW_AT_name        : HTR
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 162
    <184>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xc2>
    <189>   DW_AT_data_member_location: 36
 <2><18a>: Abbrev Number: 10 (DW_TAG_member)
    <18b>   DW_AT_name        : LTR
    <18f>   DW_AT_decl_file   : 5
    <190>   DW_AT_decl_line   : 163
    <191>   DW_AT_decl_column : 17
    <192>   DW_AT_type        : <0xc2>
    <196>   DW_AT_data_member_location: 40
 <2><197>: Abbrev Number: 1 (DW_TAG_member)
    <198>   DW_AT_name        : (indirect string, offset: 0x6c930): SQR1
    <19c>   DW_AT_decl_file   : 5
    <19d>   DW_AT_decl_line   : 164
    <19e>   DW_AT_decl_column : 17
    <19f>   DW_AT_type        : <0xc2>
    <1a3>   DW_AT_data_member_location: 44
 <2><1a4>: Abbrev Number: 1 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0xba2a): SQR2
    <1a9>   DW_AT_decl_file   : 5
    <1aa>   DW_AT_decl_line   : 165
    <1ab>   DW_AT_decl_column : 17
    <1ac>   DW_AT_type        : <0xc2>
    <1b0>   DW_AT_data_member_location: 48
 <2><1b1>: Abbrev Number: 1 (DW_TAG_member)
    <1b2>   DW_AT_name        : (indirect string, offset: 0xba2f): SQR3
    <1b6>   DW_AT_decl_file   : 5
    <1b7>   DW_AT_decl_line   : 166
    <1b8>   DW_AT_decl_column : 17
    <1b9>   DW_AT_type        : <0xc2>
    <1bd>   DW_AT_data_member_location: 52
 <2><1be>: Abbrev Number: 1 (DW_TAG_member)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x78c8b): JSQR
    <1c3>   DW_AT_decl_file   : 5
    <1c4>   DW_AT_decl_line   : 167
    <1c5>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0xc2>
    <1ca>   DW_AT_data_member_location: 56
 <2><1cb>: Abbrev Number: 1 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x63b14): JDR1
    <1d0>   DW_AT_decl_file   : 5
    <1d1>   DW_AT_decl_line   : 168
    <1d2>   DW_AT_decl_column : 17
    <1d3>   DW_AT_type        : <0xc2>
    <1d7>   DW_AT_data_member_location: 60
 <2><1d8>: Abbrev Number: 1 (DW_TAG_member)
    <1d9>   DW_AT_name        : (indirect string, offset: 0x63b19): JDR2
    <1dd>   DW_AT_decl_file   : 5
    <1de>   DW_AT_decl_line   : 169
    <1df>   DW_AT_decl_column : 17
    <1e0>   DW_AT_type        : <0xc2>
    <1e4>   DW_AT_data_member_location: 64
 <2><1e5>: Abbrev Number: 1 (DW_TAG_member)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x63b1e): JDR3
    <1ea>   DW_AT_decl_file   : 5
    <1eb>   DW_AT_decl_line   : 170
    <1ec>   DW_AT_decl_column : 17
    <1ed>   DW_AT_type        : <0xc2>
    <1f1>   DW_AT_data_member_location: 68
 <2><1f2>: Abbrev Number: 1 (DW_TAG_member)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x291dd): JDR4
    <1f7>   DW_AT_decl_file   : 5
    <1f8>   DW_AT_decl_line   : 171
    <1f9>   DW_AT_decl_column : 17
    <1fa>   DW_AT_type        : <0xc2>
    <1fe>   DW_AT_data_member_location: 72
 <2><1ff>: Abbrev Number: 10 (DW_TAG_member)
    <200>   DW_AT_name        : DR
    <203>   DW_AT_decl_file   : 5
    <204>   DW_AT_decl_line   : 172
    <205>   DW_AT_decl_column : 17
    <206>   DW_AT_type        : <0xc2>
    <20a>   DW_AT_data_member_location: 76
 <2><20b>: Abbrev Number: 0
 <1><20c>: Abbrev Number: 5 (DW_TAG_typedef)
    <20d>   DW_AT_name        : (indirect string, offset: 0x91356): ADC_TypeDef
    <211>   DW_AT_decl_file   : 5
    <212>   DW_AT_decl_line   : 173
    <213>   DW_AT_decl_column : 3
    <214>   DW_AT_type        : <0xfd>
 <1><218>: Abbrev Number: 11 (DW_TAG_structure_type)
    <219>   DW_AT_byte_size   : 24
    <21a>   DW_AT_decl_file   : 5
    <21b>   DW_AT_decl_line   : 214
    <21c>   DW_AT_decl_column : 1
    <21c>   DW_AT_linkage_name: (indirect string, offset: 0x8eb7d): 18DMA_Stream_TypeDef
    <220>   DW_AT_sibling     : <0x272>
 <2><224>: Abbrev Number: 10 (DW_TAG_member)
    <225>   DW_AT_name        : CR
    <228>   DW_AT_decl_file   : 5
    <229>   DW_AT_decl_line   : 215
    <22a>   DW_AT_decl_column : 17
    <22b>   DW_AT_type        : <0xc2>
    <22f>   DW_AT_data_member_location: 0
 <2><230>: Abbrev Number: 1 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x4c13e): NDTR
    <235>   DW_AT_decl_file   : 5
    <236>   DW_AT_decl_line   : 216
    <237>   DW_AT_decl_column : 17
    <238>   DW_AT_type        : <0xc2>
    <23c>   DW_AT_data_member_location: 4
 <2><23d>: Abbrev Number: 10 (DW_TAG_member)
    <23e>   DW_AT_name        : PAR
    <242>   DW_AT_decl_file   : 5
    <243>   DW_AT_decl_line   : 217
    <244>   DW_AT_decl_column : 17
    <245>   DW_AT_type        : <0xc2>
    <249>   DW_AT_data_member_location: 8
 <2><24a>: Abbrev Number: 1 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x40659): M0AR
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 218
    <251>   DW_AT_decl_column : 17
    <252>   DW_AT_type        : <0xc2>
    <256>   DW_AT_data_member_location: 12
 <2><257>: Abbrev Number: 1 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0xe5fa): M1AR
    <25c>   DW_AT_decl_file   : 5
    <25d>   DW_AT_decl_line   : 219
    <25e>   DW_AT_decl_column : 17
    <25f>   DW_AT_type        : <0xc2>
    <263>   DW_AT_data_member_location: 16
 <2><264>: Abbrev Number: 10 (DW_TAG_member)
    <265>   DW_AT_name        : FCR
    <269>   DW_AT_decl_file   : 5
    <26a>   DW_AT_decl_line   : 220
    <26b>   DW_AT_decl_column : 17
    <26c>   DW_AT_type        : <0xc2>
    <270>   DW_AT_data_member_location: 20
 <2><271>: Abbrev Number: 0
 <1><272>: Abbrev Number: 5 (DW_TAG_typedef)
    <273>   DW_AT_name        : (indirect string, offset: 0x8eb7f): DMA_Stream_TypeDef
    <277>   DW_AT_decl_file   : 5
    <278>   DW_AT_decl_line   : 221
    <279>   DW_AT_decl_column : 3
    <27a>   DW_AT_type        : <0x218>
 <1><27e>: Abbrev Number: 38 (DW_TAG_structure_type)
    <27f>   DW_AT_byte_size   : 28
    <280>   DW_AT_decl_file   : 5
    <281>   DW_AT_decl_line   : 499
    <283>   DW_AT_decl_column : 1
    <284>   DW_AT_linkage_name: (indirect string, offset: 0x47bf6): 13USART_TypeDef
    <288>   DW_AT_sibling     : <0x2e1>
 <2><28c>: Abbrev Number: 14 (DW_TAG_member)
    <28d>   DW_AT_name        : SR
    <290>   DW_AT_decl_file   : 5
    <290>   DW_AT_decl_line   : 500
    <292>   DW_AT_decl_column : 17
    <292>   DW_AT_type        : <0xc2>
    <296>   DW_AT_data_member_location: 0
 <2><297>: Abbrev Number: 14 (DW_TAG_member)
    <298>   DW_AT_name        : DR
    <29b>   DW_AT_decl_file   : 5
    <29b>   DW_AT_decl_line   : 501
    <29d>   DW_AT_decl_column : 17
    <29d>   DW_AT_type        : <0xc2>
    <2a1>   DW_AT_data_member_location: 4
 <2><2a2>: Abbrev Number: 14 (DW_TAG_member)
    <2a3>   DW_AT_name        : BRR
    <2a7>   DW_AT_decl_file   : 5
    <2a7>   DW_AT_decl_line   : 502
    <2a9>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0xc2>
    <2ad>   DW_AT_data_member_location: 8
 <2><2ae>: Abbrev Number: 14 (DW_TAG_member)
    <2af>   DW_AT_name        : CR1
    <2b3>   DW_AT_decl_file   : 5
    <2b3>   DW_AT_decl_line   : 503
    <2b5>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xc2>
    <2b9>   DW_AT_data_member_location: 12
 <2><2ba>: Abbrev Number: 14 (DW_TAG_member)
    <2bb>   DW_AT_name        : CR2
    <2bf>   DW_AT_decl_file   : 5
    <2bf>   DW_AT_decl_line   : 504
    <2c1>   DW_AT_decl_column : 17
    <2c1>   DW_AT_type        : <0xc2>
    <2c5>   DW_AT_data_member_location: 16
 <2><2c6>: Abbrev Number: 14 (DW_TAG_member)
    <2c7>   DW_AT_name        : CR3
    <2cb>   DW_AT_decl_file   : 5
    <2cb>   DW_AT_decl_line   : 505
    <2cd>   DW_AT_decl_column : 17
    <2cd>   DW_AT_type        : <0xc2>
    <2d1>   DW_AT_data_member_location: 20
 <2><2d2>: Abbrev Number: 39 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x2af9f): GTPR
    <2d7>   DW_AT_decl_file   : 5
    <2d8>   DW_AT_decl_line   : 506
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0xc2>
    <2df>   DW_AT_data_member_location: 24
 <2><2e0>: Abbrev Number: 0
 <1><2e1>: Abbrev Number: 40 (DW_TAG_typedef)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x47bf8): USART_TypeDef
    <2e6>   DW_AT_decl_file   : 5
    <2e7>   DW_AT_decl_line   : 507
    <2e9>   DW_AT_decl_column : 3
    <2ea>   DW_AT_type        : <0x27e>
 <1><2ee>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <2ef>   DW_AT_encoding    : 7	(unsigned)
    <2ef>   DW_AT_byte_size   : 1
    <2ef>   DW_AT_type        : <0x3d>
    <2f3>   DW_AT_decl_file   : 6
    <2f4>   DW_AT_decl_line   : 191
    <2f5>   DW_AT_decl_column : 1
    <2f5>   DW_AT_linkage_name: (indirect string, offset: 0xe969): 15FunctionalState
    <2f9>   DW_AT_sibling     : <0x30a>
 <2><2fd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x49b98): DISABLE
    <302>   DW_AT_const_value : 0
 <2><303>: Abbrev Number: 4 (DW_TAG_enumerator)
    <304>   DW_AT_name        : (indirect string, offset: 0x8fca6): ENABLE
    <308>   DW_AT_const_value : 1
 <2><309>: Abbrev Number: 0
 <1><30a>: Abbrev Number: 5 (DW_TAG_typedef)
    <30b>   DW_AT_name        : (indirect string, offset: 0xe96b): FunctionalState
    <30f>   DW_AT_decl_file   : 6
    <310>   DW_AT_decl_line   : 194
    <311>   DW_AT_decl_column : 3
    <312>   DW_AT_type        : <0x2ee>
 <1><316>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <317>   DW_AT_encoding    : 7	(unsigned)
    <317>   DW_AT_byte_size   : 1
    <317>   DW_AT_type        : <0x3d>
    <31b>   DW_AT_decl_file   : 7
    <31c>   DW_AT_decl_line   : 50
    <31d>   DW_AT_decl_column : 1
    <31d>   DW_AT_linkage_name: (indirect string, offset: 0x41e41): 15HAL_LockTypeDef
    <321>   DW_AT_sibling     : <0x332>
 <2><325>: Abbrev Number: 4 (DW_TAG_enumerator)
    <326>   DW_AT_name        : (indirect string, offset: 0x74498): HAL_UNLOCKED
    <32a>   DW_AT_const_value : 0
 <2><32b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <32c>   DW_AT_name        : (indirect string, offset: 0x9e00c): HAL_LOCKED
    <330>   DW_AT_const_value : 1
 <2><331>: Abbrev Number: 0
 <1><332>: Abbrev Number: 5 (DW_TAG_typedef)
    <333>   DW_AT_name        : (indirect string, offset: 0x41e43): HAL_LockTypeDef
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 53
    <339>   DW_AT_decl_column : 3
    <33a>   DW_AT_type        : <0x316>
 <1><33e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <33f>   DW_AT_byte_size   : 48
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 49
    <342>   DW_AT_decl_column : 1
    <342>   DW_AT_linkage_name: (indirect string, offset: 0x820ce): 15DMA_InitTypeDef
    <346>   DW_AT_sibling     : <0x3e7>
 <2><34a>: Abbrev Number: 1 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0xa82b6): Channel
    <34f>   DW_AT_decl_file   : 8
    <350>   DW_AT_decl_line   : 50
    <351>   DW_AT_decl_column : 12
    <352>   DW_AT_type        : <0xb6>
    <356>   DW_AT_data_member_location: 0
 <2><357>: Abbrev Number: 1 (DW_TAG_member)
    <358>   DW_AT_name        : (indirect string, offset: 0x3997e): Direction
    <35c>   DW_AT_decl_file   : 8
    <35d>   DW_AT_decl_line   : 53
    <35e>   DW_AT_decl_column : 12
    <35f>   DW_AT_type        : <0xb6>
    <363>   DW_AT_data_member_location: 4
 <2><364>: Abbrev Number: 1 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0xa40e): PeriphInc
    <369>   DW_AT_decl_file   : 8
    <36a>   DW_AT_decl_line   : 57
    <36b>   DW_AT_decl_column : 12
    <36c>   DW_AT_type        : <0xb6>
    <370>   DW_AT_data_member_location: 8
 <2><371>: Abbrev Number: 1 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x181e3): MemInc
    <376>   DW_AT_decl_file   : 8
    <377>   DW_AT_decl_line   : 60
    <378>   DW_AT_decl_column : 12
    <379>   DW_AT_type        : <0xb6>
    <37d>   DW_AT_data_member_location: 12
 <2><37e>: Abbrev Number: 1 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x4d5fb): PeriphDataAlignment
    <383>   DW_AT_decl_file   : 8
    <384>   DW_AT_decl_line   : 63
    <385>   DW_AT_decl_column : 12
    <386>   DW_AT_type        : <0xb6>
    <38a>   DW_AT_data_member_location: 16
 <2><38b>: Abbrev Number: 1 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0x8ed94): MemDataAlignment
    <390>   DW_AT_decl_file   : 8
    <391>   DW_AT_decl_line   : 66
    <392>   DW_AT_decl_column : 12
    <393>   DW_AT_type        : <0xb6>
    <397>   DW_AT_data_member_location: 20
 <2><398>: Abbrev Number: 1 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0xac3f3): Mode
    <39d>   DW_AT_decl_file   : 8
    <39e>   DW_AT_decl_line   : 69
    <39f>   DW_AT_decl_column : 12
    <3a0>   DW_AT_type        : <0xb6>
    <3a4>   DW_AT_data_member_location: 24
 <2><3a5>: Abbrev Number: 1 (DW_TAG_member)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xab6e9): Priority
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 74
    <3ac>   DW_AT_decl_column : 12
    <3ad>   DW_AT_type        : <0xb6>
    <3b1>   DW_AT_data_member_location: 28
 <2><3b2>: Abbrev Number: 1 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x42ee6): FIFOMode
    <3b7>   DW_AT_decl_file   : 8
    <3b8>   DW_AT_decl_line   : 77
    <3b9>   DW_AT_decl_column : 12
    <3ba>   DW_AT_type        : <0xb6>
    <3be>   DW_AT_data_member_location: 32
 <2><3bf>: Abbrev Number: 1 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x77b67): FIFOThreshold
    <3c4>   DW_AT_decl_file   : 8
    <3c5>   DW_AT_decl_line   : 82
    <3c6>   DW_AT_decl_column : 12
    <3c7>   DW_AT_type        : <0xb6>
    <3cb>   DW_AT_data_member_location: 36
 <2><3cc>: Abbrev Number: 1 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x761f6): MemBurst
    <3d1>   DW_AT_decl_file   : 8
    <3d2>   DW_AT_decl_line   : 85
    <3d3>   DW_AT_decl_column : 12
    <3d4>   DW_AT_type        : <0xb6>
    <3d8>   DW_AT_data_member_location: 40
 <2><3d9>: Abbrev Number: 1 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0x35671): PeriphBurst
    <3de>   DW_AT_decl_file   : 8
    <3df>   DW_AT_decl_line   : 91
    <3e0>   DW_AT_decl_column : 12
    <3e1>   DW_AT_type        : <0xb6>
    <3e5>   DW_AT_data_member_location: 44
 <2><3e6>: Abbrev Number: 0
 <1><3e7>: Abbrev Number: 5 (DW_TAG_typedef)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x820d0): DMA_InitTypeDef
    <3ec>   DW_AT_decl_file   : 8
    <3ed>   DW_AT_decl_line   : 96
    <3ee>   DW_AT_decl_column : 2
    <3ef>   DW_AT_type        : <0x33e>
 <1><3f3>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <3f4>   DW_AT_encoding    : 7	(unsigned)
    <3f4>   DW_AT_byte_size   : 1
    <3f4>   DW_AT_type        : <0x3d>
    <3f8>   DW_AT_decl_file   : 8
    <3f9>   DW_AT_decl_line   : 103
    <3fa>   DW_AT_decl_column : 1
    <3fa>   DW_AT_linkage_name: (indirect string, offset: 0x86ac1): 20HAL_DMA_StateTypeDef
    <3fe>   DW_AT_sibling     : <0x427>
 <2><402>: Abbrev Number: 4 (DW_TAG_enumerator)
    <403>   DW_AT_name        : (indirect string, offset: 0x755ff): HAL_DMA_STATE_RESET
    <407>   DW_AT_const_value : 0
 <2><408>: Abbrev Number: 4 (DW_TAG_enumerator)
    <409>   DW_AT_name        : (indirect string, offset: 0x2a8c7): HAL_DMA_STATE_READY
    <40d>   DW_AT_const_value : 1
 <2><40e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <40f>   DW_AT_name        : (indirect string, offset: 0x6c0c9): HAL_DMA_STATE_BUSY
    <413>   DW_AT_const_value : 2
 <2><414>: Abbrev Number: 4 (DW_TAG_enumerator)
    <415>   DW_AT_name        : (indirect string, offset: 0x9baf6): HAL_DMA_STATE_TIMEOUT
    <419>   DW_AT_const_value : 3
 <2><41a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <41b>   DW_AT_name        : (indirect string, offset: 0x871f7): HAL_DMA_STATE_ERROR
    <41f>   DW_AT_const_value : 4
 <2><420>: Abbrev Number: 4 (DW_TAG_enumerator)
    <421>   DW_AT_name        : (indirect string, offset: 0x233b8): HAL_DMA_STATE_ABORT
    <425>   DW_AT_const_value : 5
 <2><426>: Abbrev Number: 0
 <1><427>: Abbrev Number: 5 (DW_TAG_typedef)
    <428>   DW_AT_name        : (indirect string, offset: 0x86ac3): HAL_DMA_StateTypeDef
    <42c>   DW_AT_decl_file   : 8
    <42d>   DW_AT_decl_line   : 110
    <42e>   DW_AT_decl_column : 2
    <42f>   DW_AT_type        : <0x3f3>
 <1><433>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <434>   DW_AT_type        : <0x427>
 <1><438>: Abbrev Number: 25 (DW_TAG_structure_type)
    <439>   DW_AT_name        : (indirect string, offset: 0x8659a): __DMA_HandleTypeDef
    <43d>   DW_AT_byte_size   : 96
    <43e>   DW_AT_decl_file   : 8
    <43f>   DW_AT_decl_line   : 138
    <440>   DW_AT_decl_column : 16
    <440>   DW_AT_sibling     : <0x4fb>
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x3c5dc): Instance
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 140
    <44b>   DW_AT_decl_column : 31
    <44c>   DW_AT_type        : <0x4fb>
    <450>   DW_AT_data_member_location: 0
 <2><451>: Abbrev Number: 1 (DW_TAG_member)
    <452>   DW_AT_name        : (indirect string, offset: 0xa7ef4): Init
    <456>   DW_AT_decl_file   : 8
    <457>   DW_AT_decl_line   : 142
    <458>   DW_AT_decl_column : 30
    <459>   DW_AT_type        : <0x3e7>
    <45d>   DW_AT_data_member_location: 4
 <2><45e>: Abbrev Number: 1 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x6f9f2): Lock
    <463>   DW_AT_decl_file   : 8
    <464>   DW_AT_decl_line   : 144
    <465>   DW_AT_decl_column : 30
    <466>   DW_AT_type        : <0x332>
    <46a>   DW_AT_data_member_location: 52
 <2><46b>: Abbrev Number: 1 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0xa85f9): State
    <470>   DW_AT_decl_file   : 8
    <471>   DW_AT_decl_line   : 146
    <472>   DW_AT_decl_column : 30
    <473>   DW_AT_type        : <0x433>
    <477>   DW_AT_data_member_location: 53
 <2><478>: Abbrev Number: 1 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x9663c): Parent
    <47d>   DW_AT_decl_file   : 8
    <47e>   DW_AT_decl_line   : 148
    <47f>   DW_AT_decl_column : 31
    <480>   DW_AT_type        : <0xdf>
    <484>   DW_AT_data_member_location: 56
 <2><485>: Abbrev Number: 1 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x9d829): XferCpltCallback
    <48a>   DW_AT_decl_file   : 8
    <48b>   DW_AT_decl_line   : 150
    <48c>   DW_AT_decl_column : 33
    <48d>   DW_AT_type        : <0x510>
    <491>   DW_AT_data_member_location: 60
 <2><492>: Abbrev Number: 1 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x7a2d0): XferHalfCpltCallback
    <497>   DW_AT_decl_file   : 8
    <498>   DW_AT_decl_line   : 152
    <499>   DW_AT_decl_column : 33
    <49a>   DW_AT_type        : <0x510>
    <49e>   DW_AT_data_member_location: 64
 <2><49f>: Abbrev Number: 1 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x24ef9): XferM1CpltCallback
    <4a4>   DW_AT_decl_file   : 8
    <4a5>   DW_AT_decl_line   : 154
    <4a6>   DW_AT_decl_column : 33
    <4a7>   DW_AT_type        : <0x510>
    <4ab>   DW_AT_data_member_location: 68
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x561f3): XferM1HalfCpltCallback
    <4b1>   DW_AT_decl_file   : 8
    <4b2>   DW_AT_decl_line   : 156
    <4b3>   DW_AT_decl_column : 33
    <4b4>   DW_AT_type        : <0x510>
    <4b8>   DW_AT_data_member_location: 72
 <2><4b9>: Abbrev Number: 1 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x16339): XferErrorCallback
    <4be>   DW_AT_decl_file   : 8
    <4bf>   DW_AT_decl_line   : 158
    <4c0>   DW_AT_decl_column : 33
    <4c1>   DW_AT_type        : <0x510>
    <4c5>   DW_AT_data_member_location: 76
 <2><4c6>: Abbrev Number: 1 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x93ba1): XferAbortCallback
    <4cb>   DW_AT_decl_file   : 8
    <4cc>   DW_AT_decl_line   : 160
    <4cd>   DW_AT_decl_column : 33
    <4ce>   DW_AT_type        : <0x510>
    <4d2>   DW_AT_data_member_location: 80
 <2><4d3>: Abbrev Number: 1 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x9ab8d): ErrorCode
    <4d8>   DW_AT_decl_file   : 8
    <4d9>   DW_AT_decl_line   : 162
    <4da>   DW_AT_decl_column : 30
    <4db>   DW_AT_type        : <0xc2>
    <4df>   DW_AT_data_member_location: 84
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x76dd0): StreamBaseAddress
    <4e5>   DW_AT_decl_file   : 8
    <4e6>   DW_AT_decl_line   : 164
    <4e7>   DW_AT_decl_column : 30
    <4e8>   DW_AT_type        : <0xb6>
    <4ec>   DW_AT_data_member_location: 88
 <2><4ed>: Abbrev Number: 1 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x84c78): StreamIndex
    <4f2>   DW_AT_decl_file   : 8
    <4f3>   DW_AT_decl_line   : 166
    <4f4>   DW_AT_decl_column : 30
    <4f5>   DW_AT_type        : <0xb6>
    <4f9>   DW_AT_data_member_location: 92
 <2><4fa>: Abbrev Number: 0
 <1><4fb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4fc>   DW_AT_byte_size   : 4
    <4fc>   DW_AT_type        : <0x272>
 <1><500>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <501>   DW_AT_sibling     : <0x50b>
 <2><505>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <506>   DW_AT_type        : <0x50b>
 <2><50a>: Abbrev Number: 0
 <1><50b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <50c>   DW_AT_byte_size   : 4
    <50c>   DW_AT_type        : <0x438>
 <1><510>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <511>   DW_AT_byte_size   : 4
    <511>   DW_AT_type        : <0x500>
 <1><515>: Abbrev Number: 5 (DW_TAG_typedef)
    <516>   DW_AT_name        : (indirect string, offset: 0x8659c): DMA_HandleTypeDef
    <51a>   DW_AT_decl_file   : 8
    <51b>   DW_AT_decl_line   : 168
    <51c>   DW_AT_decl_column : 2
    <51d>   DW_AT_type        : <0x438>
 <1><521>: Abbrev Number: 11 (DW_TAG_structure_type)
    <522>   DW_AT_byte_size   : 48
    <523>   DW_AT_decl_file   : 9
    <524>   DW_AT_decl_line   : 60
    <525>   DW_AT_decl_column : 1
    <525>   DW_AT_linkage_name: (indirect string, offset: 0x8d00): 15ADC_InitTypeDef
    <529>   DW_AT_sibling     : <0x5ca>
 <2><52d>: Abbrev Number: 1 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x8b82c): ClockPrescaler
    <532>   DW_AT_decl_file   : 9
    <533>   DW_AT_decl_line   : 61
    <534>   DW_AT_decl_column : 12
    <535>   DW_AT_type        : <0xb6>
    <539>   DW_AT_data_member_location: 0
 <2><53a>: Abbrev Number: 1 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0xc565): Resolution
    <53f>   DW_AT_decl_file   : 9
    <540>   DW_AT_decl_line   : 64
    <541>   DW_AT_decl_column : 12
    <542>   DW_AT_type        : <0xb6>
    <546>   DW_AT_data_member_location: 4
 <2><547>: Abbrev Number: 1 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0x21b2b): DataAlign
    <54c>   DW_AT_decl_file   : 9
    <54d>   DW_AT_decl_line   : 66
    <54e>   DW_AT_decl_column : 12
    <54f>   DW_AT_type        : <0xb6>
    <553>   DW_AT_data_member_location: 8
 <2><554>: Abbrev Number: 1 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x5d9da): ScanConvMode
    <559>   DW_AT_decl_file   : 9
    <55a>   DW_AT_decl_line   : 69
    <55b>   DW_AT_decl_column : 12
    <55c>   DW_AT_type        : <0xb6>
    <560>   DW_AT_data_member_location: 12
 <2><561>: Abbrev Number: 1 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x67c03): EOCSelection
    <566>   DW_AT_decl_file   : 9
    <567>   DW_AT_decl_line   : 76
    <568>   DW_AT_decl_column : 12
    <569>   DW_AT_type        : <0xb6>
    <56d>   DW_AT_data_member_location: 16
 <2><56e>: Abbrev Number: 1 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0x40f07): ContinuousConvMode
    <573>   DW_AT_decl_file   : 9
    <574>   DW_AT_decl_line   : 83
    <575>   DW_AT_decl_column : 19
    <576>   DW_AT_type        : <0x30a>
    <57a>   DW_AT_data_member_location: 20
 <2><57b>: Abbrev Number: 1 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x5d274): NbrOfConversion
    <580>   DW_AT_decl_file   : 9
    <581>   DW_AT_decl_line   : 86
    <582>   DW_AT_decl_column : 12
    <583>   DW_AT_type        : <0xb6>
    <587>   DW_AT_data_member_location: 24
 <2><588>: Abbrev Number: 1 (DW_TAG_member)
    <589>   DW_AT_name        : (indirect string, offset: 0x3b681): DiscontinuousConvMode
    <58d>   DW_AT_decl_file   : 9
    <58e>   DW_AT_decl_line   : 89
    <58f>   DW_AT_decl_column : 19
    <590>   DW_AT_type        : <0x30a>
    <594>   DW_AT_data_member_location: 28
 <2><595>: Abbrev Number: 1 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x161c1): NbrOfDiscConversion
    <59a>   DW_AT_decl_file   : 9
    <59b>   DW_AT_decl_line   : 93
    <59c>   DW_AT_decl_column : 12
    <59d>   DW_AT_type        : <0xb6>
    <5a1>   DW_AT_data_member_location: 32
 <2><5a2>: Abbrev Number: 1 (DW_TAG_member)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x70f3b): ExternalTrigConv
    <5a7>   DW_AT_decl_file   : 9
    <5a8>   DW_AT_decl_line   : 96
    <5a9>   DW_AT_decl_column : 12
    <5aa>   DW_AT_type        : <0xb6>
    <5ae>   DW_AT_data_member_location: 36
 <2><5af>: Abbrev Number: 1 (DW_TAG_member)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x2a51c): ExternalTrigConvEdge
    <5b4>   DW_AT_decl_file   : 9
    <5b5>   DW_AT_decl_line   : 100
    <5b6>   DW_AT_decl_column : 12
    <5b7>   DW_AT_type        : <0xb6>
    <5bb>   DW_AT_data_member_location: 40
 <2><5bc>: Abbrev Number: 1 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x3da93): DMAContinuousRequests
    <5c1>   DW_AT_decl_file   : 9
    <5c2>   DW_AT_decl_line   : 103
    <5c3>   DW_AT_decl_column : 19
    <5c4>   DW_AT_type        : <0x30a>
    <5c8>   DW_AT_data_member_location: 44
 <2><5c9>: Abbrev Number: 0
 <1><5ca>: Abbrev Number: 5 (DW_TAG_typedef)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x8d02): ADC_InitTypeDef
    <5cf>   DW_AT_decl_file   : 9
    <5d0>   DW_AT_decl_line   : 108
    <5d1>   DW_AT_decl_column : 3
    <5d2>   DW_AT_type        : <0x521>
 <1><5d6>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5d7>   DW_AT_byte_size   : 72
    <5d8>   DW_AT_decl_file   : 9
    <5d9>   DW_AT_decl_line   : 197
    <5da>   DW_AT_decl_column : 1
    <5da>   DW_AT_linkage_name: (indirect string, offset: 0x35bbf): 17ADC_HandleTypeDef
    <5de>   DW_AT_sibling     : <0x63e>
 <2><5e2>: Abbrev Number: 1 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x3c5dc): Instance
    <5e7>   DW_AT_decl_file   : 9
    <5e8>   DW_AT_decl_line   : 198
    <5e9>   DW_AT_decl_column : 34
    <5ea>   DW_AT_type        : <0x63e>
    <5ee>   DW_AT_data_member_location: 0
 <2><5ef>: Abbrev Number: 1 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0xa7ef4): Init
    <5f4>   DW_AT_decl_file   : 9
    <5f5>   DW_AT_decl_line   : 200
    <5f6>   DW_AT_decl_column : 33
    <5f7>   DW_AT_type        : <0x5ca>
    <5fb>   DW_AT_data_member_location: 4
 <2><5fc>: Abbrev Number: 1 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x27ea7): NbrOfCurrentConversionRank
    <601>   DW_AT_decl_file   : 9
    <602>   DW_AT_decl_line   : 202
    <603>   DW_AT_decl_column : 33
    <604>   DW_AT_type        : <0xc2>
    <608>   DW_AT_data_member_location: 52
 <2><609>: Abbrev Number: 1 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0x55cf6): DMA_Handle
    <60e>   DW_AT_decl_file   : 9
    <60f>   DW_AT_decl_line   : 204
    <610>   DW_AT_decl_column : 34
    <611>   DW_AT_type        : <0x643>
    <615>   DW_AT_data_member_location: 56
 <2><616>: Abbrev Number: 1 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0x6f9f2): Lock
    <61b>   DW_AT_decl_file   : 9
    <61c>   DW_AT_decl_line   : 206
    <61d>   DW_AT_decl_column : 33
    <61e>   DW_AT_type        : <0x332>
    <622>   DW_AT_data_member_location: 60
 <2><623>: Abbrev Number: 1 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0xa85f9): State
    <628>   DW_AT_decl_file   : 9
    <629>   DW_AT_decl_line   : 208
    <62a>   DW_AT_decl_column : 33
    <62b>   DW_AT_type        : <0xc2>
    <62f>   DW_AT_data_member_location: 64
 <2><630>: Abbrev Number: 1 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x9ab8d): ErrorCode
    <635>   DW_AT_decl_file   : 9
    <636>   DW_AT_decl_line   : 210
    <637>   DW_AT_decl_column : 33
    <638>   DW_AT_type        : <0xc2>
    <63c>   DW_AT_data_member_location: 68
 <2><63d>: Abbrev Number: 0
 <1><63e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <63f>   DW_AT_byte_size   : 4
    <63f>   DW_AT_type        : <0x20c>
 <1><643>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <644>   DW_AT_byte_size   : 4
    <644>   DW_AT_type        : <0x515>
 <1><648>: Abbrev Number: 5 (DW_TAG_typedef)
    <649>   DW_AT_name        : (indirect string, offset: 0x35bc1): ADC_HandleTypeDef
    <64d>   DW_AT_decl_file   : 9
    <64e>   DW_AT_decl_line   : 220
    <64f>   DW_AT_decl_column : 3
    <650>   DW_AT_type        : <0x5d6>
 <1><654>: Abbrev Number: 11 (DW_TAG_structure_type)
    <655>   DW_AT_byte_size   : 28
    <656>   DW_AT_decl_file   : 10
    <657>   DW_AT_decl_line   : 47
    <658>   DW_AT_decl_column : 1
    <658>   DW_AT_linkage_name: (indirect string, offset: 0x42170): 16UART_InitTypeDef
    <65c>   DW_AT_sibling     : <0x6bc>
 <2><660>: Abbrev Number: 1 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x90b90): BaudRate
    <665>   DW_AT_decl_file   : 10
    <666>   DW_AT_decl_line   : 48
    <667>   DW_AT_decl_column : 12
    <668>   DW_AT_type        : <0xb6>
    <66c>   DW_AT_data_member_location: 0
 <2><66d>: Abbrev Number: 1 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x47b5): WordLength
    <672>   DW_AT_decl_file   : 10
    <673>   DW_AT_decl_line   : 54
    <674>   DW_AT_decl_column : 12
    <675>   DW_AT_type        : <0xb6>
    <679>   DW_AT_data_member_location: 4
 <2><67a>: Abbrev Number: 1 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x91305): StopBits
    <67f>   DW_AT_decl_file   : 10
    <680>   DW_AT_decl_line   : 57
    <681>   DW_AT_decl_column : 12
    <682>   DW_AT_type        : <0xb6>
    <686>   DW_AT_data_member_location: 8
 <2><687>: Abbrev Number: 1 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x37f0a): Parity
    <68c>   DW_AT_decl_file   : 10
    <68d>   DW_AT_decl_line   : 60
    <68e>   DW_AT_decl_column : 12
    <68f>   DW_AT_type        : <0xb6>
    <693>   DW_AT_data_member_location: 12
 <2><694>: Abbrev Number: 1 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0xac3f3): Mode
    <699>   DW_AT_decl_file   : 10
    <69a>   DW_AT_decl_line   : 67
    <69b>   DW_AT_decl_column : 12
    <69c>   DW_AT_type        : <0xb6>
    <6a0>   DW_AT_data_member_location: 16
 <2><6a1>: Abbrev Number: 1 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x11f10): HwFlowCtl
    <6a6>   DW_AT_decl_file   : 10
    <6a7>   DW_AT_decl_line   : 70
    <6a8>   DW_AT_decl_column : 12
    <6a9>   DW_AT_type        : <0xb6>
    <6ad>   DW_AT_data_member_location: 20
 <2><6ae>: Abbrev Number: 1 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x847d3): OverSampling
    <6b3>   DW_AT_decl_file   : 10
    <6b4>   DW_AT_decl_line   : 73
    <6b5>   DW_AT_decl_column : 12
    <6b6>   DW_AT_type        : <0xb6>
    <6ba>   DW_AT_data_member_location: 24
 <2><6bb>: Abbrev Number: 0
 <1><6bc>: Abbrev Number: 5 (DW_TAG_typedef)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x42172): UART_InitTypeDef
    <6c1>   DW_AT_decl_file   : 10
    <6c2>   DW_AT_decl_line   : 75
    <6c3>   DW_AT_decl_column : 3
    <6c4>   DW_AT_type        : <0x654>
 <1><6c8>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <6c9>   DW_AT_encoding    : 7	(unsigned)
    <6c9>   DW_AT_byte_size   : 1
    <6c9>   DW_AT_type        : <0x3d>
    <6cd>   DW_AT_decl_file   : 10
    <6ce>   DW_AT_decl_line   : 117
    <6cf>   DW_AT_decl_column : 1
    <6cf>   DW_AT_linkage_name: (indirect string, offset: 0x11773): 21HAL_UART_StateTypeDef
    <6d3>   DW_AT_sibling     : <0x708>
 <2><6d7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x5b516): HAL_UART_STATE_RESET
    <6dc>   DW_AT_const_value : 0
 <2><6dd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0x11b99): HAL_UART_STATE_READY
    <6e2>   DW_AT_const_value : 32
 <2><6e3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x8c1f2): HAL_UART_STATE_BUSY
    <6e8>   DW_AT_const_value : 36
 <2><6e9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x1dae): HAL_UART_STATE_BUSY_TX
    <6ee>   DW_AT_const_value : 33
 <2><6ef>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x158f): HAL_UART_STATE_BUSY_RX
    <6f4>   DW_AT_const_value : 34
 <2><6f5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x22c82): HAL_UART_STATE_BUSY_TX_RX
    <6fa>   DW_AT_const_value : 35
 <2><6fb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x4b7f9): HAL_UART_STATE_TIMEOUT
    <700>   DW_AT_const_value : 160
 <2><701>: Abbrev Number: 4 (DW_TAG_enumerator)
    <702>   DW_AT_name        : (indirect string, offset: 0x6c9aa): HAL_UART_STATE_ERROR
    <706>   DW_AT_const_value : 224
 <2><707>: Abbrev Number: 0
 <1><708>: Abbrev Number: 5 (DW_TAG_typedef)
    <709>   DW_AT_name        : (indirect string, offset: 0x11775): HAL_UART_StateTypeDef
    <70d>   DW_AT_decl_file   : 10
    <70e>   DW_AT_decl_line   : 135
    <70f>   DW_AT_decl_column : 3
    <710>   DW_AT_type        : <0x6c8>
 <1><714>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <715>   DW_AT_type        : <0x708>
 <1><719>: Abbrev Number: 5 (DW_TAG_typedef)
    <71a>   DW_AT_name        : (indirect string, offset: 0x3f626): HAL_UART_RxTypeTypeDef
    <71e>   DW_AT_decl_file   : 10
    <71f>   DW_AT_decl_line   : 144
    <720>   DW_AT_decl_column : 18
    <721>   DW_AT_type        : <0xb6>
 <1><725>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <726>   DW_AT_type        : <0x719>
 <1><72a>: Abbrev Number: 5 (DW_TAG_typedef)
    <72b>   DW_AT_name        : (indirect string, offset: 0x13119): HAL_UART_RxEventTypeTypeDef
    <72f>   DW_AT_decl_file   : 10
    <730>   DW_AT_decl_line   : 155
    <731>   DW_AT_decl_column : 18
    <732>   DW_AT_type        : <0xb6>
 <1><736>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <737>   DW_AT_type        : <0x72a>
 <1><73b>: Abbrev Number: 25 (DW_TAG_structure_type)
    <73c>   DW_AT_name        : (indirect string, offset: 0x9f34e): __UART_HandleTypeDef
    <740>   DW_AT_byte_size   : 72
    <741>   DW_AT_decl_file   : 10
    <742>   DW_AT_decl_line   : 160
    <743>   DW_AT_decl_column : 16
    <743>   DW_AT_sibling     : <0x818>
 <2><747>: Abbrev Number: 1 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x3c5dc): Instance
    <74c>   DW_AT_decl_file   : 10
    <74d>   DW_AT_decl_line   : 162
    <74e>   DW_AT_decl_column : 34
    <74f>   DW_AT_type        : <0x818>
    <753>   DW_AT_data_member_location: 0
 <2><754>: Abbrev Number: 1 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0xa7ef4): Init
    <759>   DW_AT_decl_file   : 10
    <75a>   DW_AT_decl_line   : 164
    <75b>   DW_AT_decl_column : 33
    <75c>   DW_AT_type        : <0x6bc>
    <760>   DW_AT_data_member_location: 4
 <2><761>: Abbrev Number: 1 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x4a6a5): pTxBuffPtr
    <766>   DW_AT_decl_file   : 10
    <767>   DW_AT_decl_line   : 166
    <768>   DW_AT_decl_column : 34
    <769>   DW_AT_type        : <0x81d>
    <76d>   DW_AT_data_member_location: 32
 <2><76e>: Abbrev Number: 1 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x49e2): TxXferSize
    <773>   DW_AT_decl_file   : 10
    <774>   DW_AT_decl_line   : 168
    <775>   DW_AT_decl_column : 33
    <776>   DW_AT_type        : <0xa5>
    <77a>   DW_AT_data_member_location: 36
 <2><77b>: Abbrev Number: 1 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x4b667): TxXferCount
    <780>   DW_AT_decl_file   : 10
    <781>   DW_AT_decl_line   : 170
    <782>   DW_AT_decl_column : 33
    <783>   DW_AT_type        : <0xb1>
    <787>   DW_AT_data_member_location: 38
 <2><788>: Abbrev Number: 1 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x930b3): pRxBuffPtr
    <78d>   DW_AT_decl_file   : 10
    <78e>   DW_AT_decl_line   : 172
    <78f>   DW_AT_decl_column : 34
    <790>   DW_AT_type        : <0x822>
    <794>   DW_AT_data_member_location: 40
 <2><795>: Abbrev Number: 1 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x4d692): RxXferSize
    <79a>   DW_AT_decl_file   : 10
    <79b>   DW_AT_decl_line   : 174
    <79c>   DW_AT_decl_column : 33
    <79d>   DW_AT_type        : <0xa5>
    <7a1>   DW_AT_data_member_location: 44
 <2><7a2>: Abbrev Number: 1 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x5d614): RxXferCount
    <7a7>   DW_AT_decl_file   : 10
    <7a8>   DW_AT_decl_line   : 176
    <7a9>   DW_AT_decl_column : 33
    <7aa>   DW_AT_type        : <0xb1>
    <7ae>   DW_AT_data_member_location: 46
 <2><7af>: Abbrev Number: 1 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x83dd9): ReceptionType
    <7b4>   DW_AT_decl_file   : 10
    <7b5>   DW_AT_decl_line   : 178
    <7b6>   DW_AT_decl_column : 31
    <7b7>   DW_AT_type        : <0x725>
    <7bb>   DW_AT_data_member_location: 48
 <2><7bc>: Abbrev Number: 1 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xad27b): RxEventType
    <7c1>   DW_AT_decl_file   : 10
    <7c2>   DW_AT_decl_line   : 180
    <7c3>   DW_AT_decl_column : 36
    <7c4>   DW_AT_type        : <0x736>
    <7c8>   DW_AT_data_member_location: 52
 <2><7c9>: Abbrev Number: 1 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x9a04f): hdmatx
    <7ce>   DW_AT_decl_file   : 10
    <7cf>   DW_AT_decl_line   : 182
    <7d0>   DW_AT_decl_column : 34
    <7d1>   DW_AT_type        : <0x643>
    <7d5>   DW_AT_data_member_location: 56
 <2><7d6>: Abbrev Number: 1 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x99624): hdmarx
    <7db>   DW_AT_decl_file   : 10
    <7dc>   DW_AT_decl_line   : 184
    <7dd>   DW_AT_decl_column : 34
    <7de>   DW_AT_type        : <0x643>
    <7e2>   DW_AT_data_member_location: 60
 <2><7e3>: Abbrev Number: 1 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x6f9f2): Lock
    <7e8>   DW_AT_decl_file   : 10
    <7e9>   DW_AT_decl_line   : 186
    <7ea>   DW_AT_decl_column : 33
    <7eb>   DW_AT_type        : <0x332>
    <7ef>   DW_AT_data_member_location: 64
 <2><7f0>: Abbrev Number: 1 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x3ee65): gState
    <7f5>   DW_AT_decl_file   : 10
    <7f6>   DW_AT_decl_line   : 188
    <7f7>   DW_AT_decl_column : 33
    <7f8>   DW_AT_type        : <0x714>
    <7fc>   DW_AT_data_member_location: 65
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x8e80c): RxState
    <802>   DW_AT_decl_file   : 10
    <803>   DW_AT_decl_line   : 192
    <804>   DW_AT_decl_column : 33
    <805>   DW_AT_type        : <0x714>
    <809>   DW_AT_data_member_location: 66
 <2><80a>: Abbrev Number: 1 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x9ab8d): ErrorCode
    <80f>   DW_AT_decl_file   : 10
    <810>   DW_AT_decl_line   : 195
    <811>   DW_AT_decl_column : 33
    <812>   DW_AT_type        : <0xc2>
    <816>   DW_AT_data_member_location: 68
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <819>   DW_AT_byte_size   : 4
    <819>   DW_AT_type        : <0x2e1>
 <1><81d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <81e>   DW_AT_byte_size   : 4
    <81e>   DW_AT_type        : <0xa0>
 <1><822>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <823>   DW_AT_byte_size   : 4
    <823>   DW_AT_type        : <0x94>
 <1><827>: Abbrev Number: 5 (DW_TAG_typedef)
    <828>   DW_AT_name        : (indirect string, offset: 0x9f350): UART_HandleTypeDef
    <82c>   DW_AT_decl_file   : 10
    <82d>   DW_AT_decl_line   : 213
    <82e>   DW_AT_decl_column : 3
    <82f>   DW_AT_type        : <0x73b>
 <1><833>: Abbrev Number: 26 (DW_TAG_variable)
    <834>   DW_AT_name        : (indirect string, offset: 0x41404): huart1
    <838>   DW_AT_decl_file   : 11
    <839>   DW_AT_decl_line   : 35
    <839>   DW_AT_decl_column : 27
    <83a>   DW_AT_type        : <0x827>
    <83e>   DW_AT_external    : 1
    <83e>   DW_AT_declaration : 1
 <1><83e>: Abbrev Number: 26 (DW_TAG_variable)
    <83f>   DW_AT_name        : (indirect string, offset: 0x3f314): hadc1
    <843>   DW_AT_decl_file   : 12
    <844>   DW_AT_decl_line   : 35
    <844>   DW_AT_decl_column : 26
    <845>   DW_AT_type        : <0x648>
    <849>   DW_AT_external    : 1
    <849>   DW_AT_declaration : 1
 <1><849>: Abbrev Number: 18 (DW_TAG_namespace)
    <84a>   DW_AT_name        : (indirect string, offset: 0x9cc77): System_Rtos
    <84e>   DW_AT_decl_file   : 14
    <84f>   DW_AT_decl_line   : 19
    <850>   DW_AT_decl_column : 11
    <851>   DW_AT_sibling     : <0x868>
 <2><855>: Abbrev Number: 42 (DW_TAG_subprogram)
    <856>   DW_AT_external    : 1
    <856>   DW_AT_name        : (indirect string, offset: 0x97dcc): delay
    <85a>   DW_AT_decl_file   : 14
    <85b>   DW_AT_decl_line   : 21
    <85c>   DW_AT_decl_column : 6
    <85d>   DW_AT_linkage_name: (indirect string, offset: 0x1bca5): _ZN11System_Rtos5delayEm
    <861>   DW_AT_declaration : 1
 <3><861>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <862>   DW_AT_type        : <0xb6>
 <3><866>: Abbrev Number: 0
 <2><867>: Abbrev Number: 0
 <1><868>: Abbrev Number: 43 (DW_TAG_namespace)
    <869>   DW_AT_name        : std
    <86d>   DW_AT_decl_file   : 21
    <86e>   DW_AT_decl_line   : 296
    <870>   DW_AT_decl_column : 11
    <871>   DW_AT_sibling     : <0x9c4>
 <2><875>: Abbrev Number: 15 (DW_TAG_namespace)
    <876>   DW_AT_name        : (indirect string, offset: 0x5bb2): __swappable_details
    <87a>   DW_AT_decl_file   : 13
    <87b>   DW_AT_decl_line   : 2713
    <87d>   DW_AT_decl_column : 13
 <2><87e>: Abbrev Number: 15 (DW_TAG_namespace)
    <87f>   DW_AT_name        : (indirect string, offset: 0x90899): __swappable_with_details
    <883>   DW_AT_decl_file   : 13
    <884>   DW_AT_decl_line   : 2799
    <886>   DW_AT_decl_column : 13
 <2><887>: Abbrev Number: 18 (DW_TAG_namespace)
    <888>   DW_AT_name        : (indirect string, offset: 0x3b6d2): ranges
    <88c>   DW_AT_decl_file   : 15
    <88d>   DW_AT_decl_line   : 163
    <88e>   DW_AT_decl_column : 13
    <88f>   DW_AT_sibling     : <0x8be>
 <3><893>: Abbrev Number: 16 (DW_TAG_namespace)
    <894>   DW_AT_name        : (indirect string, offset: 0x24707): __cust_swap
    <898>   DW_AT_decl_file   : 15
    <899>   DW_AT_decl_line   : 165
    <89a>   DW_AT_decl_column : 15
 <3><89b>: Abbrev Number: 44 (DW_TAG_namespace)
    <89c>   DW_AT_name        : (indirect string, offset: 0x32d4f): __cust
    <8a0>   DW_AT_decl_file   : 15
    <8a1>   DW_AT_decl_line   : 225
    <8a2>   DW_AT_decl_column : 22
    <8a3>   DW_AT_export_symbols: 1
 <3><8a3>: Abbrev Number: 16 (DW_TAG_namespace)
    <8a4>   DW_AT_name        : (indirect string, offset: 0x7e3d8): __cust_imove
    <8a8>   DW_AT_decl_file   : 16
    <8a9>   DW_AT_decl_line   : 100
    <8aa>   DW_AT_decl_column : 15
 <3><8ab>: Abbrev Number: 15 (DW_TAG_namespace)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x977f0): __cust_iswap
    <8b0>   DW_AT_decl_file   : 16
    <8b1>   DW_AT_decl_line   : 820
    <8b3>   DW_AT_decl_column : 13
 <3><8b4>: Abbrev Number: 15 (DW_TAG_namespace)
    <8b5>   DW_AT_name        : (indirect string, offset: 0x392d8): __cust_access
    <8b9>   DW_AT_decl_file   : 16
    <8ba>   DW_AT_decl_line   : 948
    <8bc>   DW_AT_decl_column : 21
 <3><8bd>: Abbrev Number: 0
 <2><8be>: Abbrev Number: 16 (DW_TAG_namespace)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x42f2f): __cmp_cat
    <8c3>   DW_AT_decl_file   : 17
    <8c4>   DW_AT_decl_line   : 49
    <8c5>   DW_AT_decl_column : 13
 <2><8c6>: Abbrev Number: 16 (DW_TAG_namespace)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x535dd): __detail
    <8cb>   DW_AT_decl_file   : 15
    <8cc>   DW_AT_decl_line   : 54
    <8cd>   DW_AT_decl_column : 13
 <2><8ce>: Abbrev Number: 15 (DW_TAG_namespace)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x82e11): __cmp_cust
    <8d3>   DW_AT_decl_file   : 17
    <8d4>   DW_AT_decl_line   : 571
    <8d6>   DW_AT_decl_column : 13
 <2><8d7>: Abbrev Number: 45 (DW_TAG_namespace)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x98892): __cmp_alg
    <8dc>   DW_AT_decl_file   : 17
    <8dd>   DW_AT_decl_line   : 1175
    <8df>   DW_AT_decl_column : 20
    <8e0>   DW_AT_export_symbols: 1
 <2><8e0>: Abbrev Number: 16 (DW_TAG_namespace)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x1ac45): __debug
    <8e5>   DW_AT_decl_file   : 18
    <8e6>   DW_AT_decl_line   : 50
    <8e7>   DW_AT_decl_column : 13
 <2><8e8>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <8e9>   DW_AT_decl_file   : 19
    <8e9>   DW_AT_decl_line   : 127
    <8ea>   DW_AT_decl_column : 11
    <8eb>   DW_AT_import      : <0xaa8>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><8ef>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <8f0>   DW_AT_decl_file   : 19
    <8f0>   DW_AT_decl_line   : 128
    <8f1>   DW_AT_decl_column : 11
    <8f2>   DW_AT_import      : <0xadb>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><8f6>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <8f7>   DW_AT_decl_file   : 19
    <8f7>   DW_AT_decl_line   : 134
    <8f8>   DW_AT_decl_column : 11
    <8f9>   DW_AT_import      : <0xb3f>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><8fd>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <8fe>   DW_AT_decl_file   : 19
    <8fe>   DW_AT_decl_line   : 140
    <8ff>   DW_AT_decl_column : 11
    <900>   DW_AT_import      : <0xb54>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><904>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <905>   DW_AT_decl_file   : 19
    <905>   DW_AT_decl_line   : 141
    <906>   DW_AT_decl_column : 11
    <907>   DW_AT_import      : <0xb69>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><90b>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <90c>   DW_AT_decl_file   : 19
    <90c>   DW_AT_decl_line   : 142
    <90d>   DW_AT_decl_column : 11
    <90e>   DW_AT_import      : <0xb7e>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><912>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <913>   DW_AT_decl_file   : 19
    <913>   DW_AT_decl_line   : 143
    <914>   DW_AT_decl_column : 11
    <915>   DW_AT_import      : <0xb93>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><919>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <91a>   DW_AT_decl_file   : 19
    <91a>   DW_AT_decl_line   : 145
    <91b>   DW_AT_decl_column : 11
    <91c>   DW_AT_import      : <0xbbc>	[Abbrev Number: 51 (DW_TAG_subprogram)]
 <2><920>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <921>   DW_AT_decl_file   : 19
    <921>   DW_AT_decl_line   : 148
    <922>   DW_AT_decl_column : 11
    <923>   DW_AT_import      : <0xbd7>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><927>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <928>   DW_AT_decl_file   : 19
    <928>   DW_AT_decl_line   : 150
    <929>   DW_AT_decl_column : 11
    <92a>   DW_AT_import      : <0xbec>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><92e>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <92f>   DW_AT_decl_file   : 19
    <92f>   DW_AT_decl_line   : 153
    <930>   DW_AT_decl_column : 11
    <931>   DW_AT_import      : <0xc06>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><935>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <936>   DW_AT_decl_file   : 19
    <936>   DW_AT_decl_line   : 154
    <937>   DW_AT_decl_column : 11
    <938>   DW_AT_import      : <0xc20>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><93c>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <93d>   DW_AT_decl_file   : 19
    <93d>   DW_AT_decl_line   : 155
    <93e>   DW_AT_decl_column : 11
    <93f>   DW_AT_import      : <0xc3f>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><943>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <944>   DW_AT_decl_file   : 19
    <944>   DW_AT_decl_line   : 157
    <945>   DW_AT_decl_column : 11
    <946>   DW_AT_import      : <0xc5e>	[Abbrev Number: 27 (DW_TAG_subprogram)]
 <2><94a>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <94b>   DW_AT_decl_file   : 19
    <94b>   DW_AT_decl_line   : 163
    <94c>   DW_AT_decl_column : 11
    <94d>   DW_AT_import      : <0xc7d>	[Abbrev Number: 52 (DW_TAG_subprogram)]
 <2><951>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <952>   DW_AT_decl_file   : 19
    <952>   DW_AT_decl_line   : 165
    <953>   DW_AT_decl_column : 11
    <954>   DW_AT_import      : <0xc89>	[Abbrev Number: 27 (DW_TAG_subprogram)]
 <2><958>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <959>   DW_AT_decl_file   : 19
    <959>   DW_AT_decl_line   : 166
    <95a>   DW_AT_decl_column : 11
    <95b>   DW_AT_import      : <0xc99>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><95f>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <960>   DW_AT_decl_file   : 19
    <960>   DW_AT_decl_line   : 167
    <961>   DW_AT_decl_column : 11
    <962>   DW_AT_import      : <0xcb8>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><966>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <967>   DW_AT_decl_file   : 19
    <967>   DW_AT_decl_line   : 168
    <968>   DW_AT_decl_column : 11
    <969>   DW_AT_import      : <0xcd7>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><96d>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <96e>   DW_AT_decl_file   : 19
    <96e>   DW_AT_decl_line   : 169
    <96f>   DW_AT_decl_column : 11
    <970>   DW_AT_import      : <0xcf6>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><974>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <975>   DW_AT_decl_file   : 19
    <975>   DW_AT_decl_line   : 171
    <976>   DW_AT_decl_column : 11
    <977>   DW_AT_import      : <0xd0b>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><97b>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <97c>   DW_AT_decl_file   : 19
    <97c>   DW_AT_decl_line   : 172
    <97d>   DW_AT_decl_column : 11
    <97e>   DW_AT_import      : <0xd2f>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><982>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <983>   DW_AT_decl_file   : 19
    <983>   DW_AT_decl_line   : 240
    <984>   DW_AT_decl_column : 22
    <985>   DW_AT_import      : <0xb0e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><989>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <98a>   DW_AT_decl_file   : 19
    <98a>   DW_AT_decl_line   : 245
    <98b>   DW_AT_decl_column : 22
    <98c>   DW_AT_import      : <0xa50>	[Abbrev Number: 48 (DW_TAG_subprogram)]
 <2><990>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <991>   DW_AT_decl_file   : 19
    <991>   DW_AT_decl_line   : 246
    <992>   DW_AT_decl_column : 22
    <993>   DW_AT_import      : <0xd49>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><997>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <998>   DW_AT_decl_file   : 19
    <998>   DW_AT_decl_line   : 248
    <999>   DW_AT_decl_column : 22
    <99a>   DW_AT_import      : <0xd64>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><99e>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <99f>   DW_AT_decl_file   : 19
    <99f>   DW_AT_decl_line   : 249
    <9a0>   DW_AT_decl_column : 22
    <9a1>   DW_AT_import      : <0xdba>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><9a5>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <9a6>   DW_AT_decl_file   : 19
    <9a6>   DW_AT_decl_line   : 250
    <9a7>   DW_AT_decl_column : 22
    <9a8>   DW_AT_import      : <0xd7a>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><9ac>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <9ad>   DW_AT_decl_file   : 19
    <9ad>   DW_AT_decl_line   : 251
    <9ae>   DW_AT_decl_column : 22
    <9af>   DW_AT_import      : <0xd9a>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><9b3>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <9b4>   DW_AT_decl_file   : 19
    <9b4>   DW_AT_decl_line   : 252
    <9b5>   DW_AT_decl_column : 22
    <9b6>   DW_AT_import      : <0xdd4>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><9ba>: Abbrev Number: 15 (DW_TAG_namespace)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x644c): placeholders
    <9bf>   DW_AT_decl_file   : 20
    <9c0>   DW_AT_decl_line   : 279
    <9c2>   DW_AT_decl_column : 13
 <2><9c3>: Abbrev Number: 0
 <1><9c4>: Abbrev Number: 7 (DW_TAG_base_type)
    <9c5>   DW_AT_byte_size   : 1
    <9c6>   DW_AT_encoding    : 2	(boolean)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x15f7): bool
 <1><9cb>: Abbrev Number: 7 (DW_TAG_base_type)
    <9cc>   DW_AT_byte_size   : 4
    <9cd>   DW_AT_encoding    : 7	(unsigned)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x81b37): wchar_t
 <1><9d2>: Abbrev Number: 12 (DW_TAG_const_type)
    <9d3>   DW_AT_type        : <0x9cb>
 <1><9d7>: Abbrev Number: 7 (DW_TAG_base_type)
    <9d8>   DW_AT_byte_size   : 1
    <9d9>   DW_AT_encoding    : 7	(unsigned)
    <9da>   DW_AT_name        : (indirect string, offset: 0x41e53): char8_t
 <1><9de>: Abbrev Number: 7 (DW_TAG_base_type)
    <9df>   DW_AT_byte_size   : 2
    <9e0>   DW_AT_encoding    : 16	(unicode string)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x9408b): char16_t
 <1><9e5>: Abbrev Number: 7 (DW_TAG_base_type)
    <9e6>   DW_AT_byte_size   : 4
    <9e7>   DW_AT_encoding    : 16	(unicode string)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x4aa0a): char32_t
 <1><9ec>: Abbrev Number: 46 (DW_TAG_const_type)
 <1><9ed>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9ee>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_type        : <0x9ec>
 <1><9f2>: Abbrev Number: 7 (DW_TAG_base_type)
    <9f3>   DW_AT_byte_size   : 4
    <9f4>   DW_AT_encoding    : 4	(float)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x87879): float
 <1><9f9>: Abbrev Number: 12 (DW_TAG_const_type)
    <9fa>   DW_AT_type        : <0x9f2>
 <1><9fe>: Abbrev Number: 7 (DW_TAG_base_type)
    <9ff>   DW_AT_byte_size   : 8
    <a00>   DW_AT_encoding    : 4	(float)
    <a01>   DW_AT_name        : (indirect string, offset: 0x12b15): double
 <1><a05>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
    <a06>   DW_AT_type        : <0x9cb>
 <1><a0a>: Abbrev Number: 47 (DW_TAG_namespace)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x96c6b): __gnu_cxx
    <a0f>   DW_AT_decl_file   : 21
    <a10>   DW_AT_decl_line   : 333
    <a12>   DW_AT_decl_column : 11
    <a13>   DW_AT_sibling     : <0xa6c>
 <2><a17>: Abbrev Number: 16 (DW_TAG_namespace)
    <a18>   DW_AT_name        : (indirect string, offset: 0x6ff40): __ops
    <a1c>   DW_AT_decl_file   : 22
    <a1d>   DW_AT_decl_line   : 37
    <a1e>   DW_AT_decl_column : 11
 <2><a1f>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a20>   DW_AT_decl_file   : 19
    <a20>   DW_AT_decl_line   : 200
    <a21>   DW_AT_decl_column : 11
    <a22>   DW_AT_import      : <0xb0e>	[Abbrev Number: 5 (DW_TAG_typedef)]
 <2><a26>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a27>   DW_AT_decl_file   : 19
    <a27>   DW_AT_decl_line   : 216
    <a28>   DW_AT_decl_column : 11
    <a29>   DW_AT_import      : <0xd49>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><a2d>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a2e>   DW_AT_decl_file   : 19
    <a2e>   DW_AT_decl_line   : 227
    <a2f>   DW_AT_decl_column : 11
    <a30>   DW_AT_import      : <0xd64>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><a34>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a35>   DW_AT_decl_file   : 19
    <a35>   DW_AT_decl_line   : 228
    <a36>   DW_AT_decl_column : 11
    <a37>   DW_AT_import      : <0xd7a>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><a3b>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a3c>   DW_AT_decl_file   : 19
    <a3c>   DW_AT_decl_line   : 229
    <a3d>   DW_AT_decl_column : 11
    <a3e>   DW_AT_import      : <0xd9a>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><a42>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a43>   DW_AT_decl_file   : 19
    <a43>   DW_AT_decl_line   : 231
    <a44>   DW_AT_decl_column : 11
    <a45>   DW_AT_import      : <0xdba>	[Abbrev Number: 8 (DW_TAG_subprogram)]
 <2><a49>: Abbrev Number: 3 (DW_TAG_imported_declaration)
    <a4a>   DW_AT_decl_file   : 19
    <a4a>   DW_AT_decl_line   : 232
    <a4b>   DW_AT_decl_column : 11
    <a4c>   DW_AT_import      : <0xdd4>	[Abbrev Number: 19 (DW_TAG_subprogram)]
 <2><a50>: Abbrev Number: 48 (DW_TAG_subprogram)
    <a51>   DW_AT_external    : 1
    <a51>   DW_AT_name        : div
    <a55>   DW_AT_decl_file   : 19
    <a56>   DW_AT_decl_line   : 213
    <a57>   DW_AT_decl_column : 3
    <a58>   DW_AT_linkage_name: (indirect string, offset: 0x1cdd4): _ZN9__gnu_cxx3divExx
    <a5c>   DW_AT_type        : <0xb0e>
    <a60>   DW_AT_declaration : 1
 <3><a60>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a61>   DW_AT_type        : <0x78>
 <3><a65>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a66>   DW_AT_type        : <0x78>
 <3><a6a>: Abbrev Number: 0
 <2><a6b>: Abbrev Number: 0
 <1><a6c>: Abbrev Number: 18 (DW_TAG_namespace)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x98ad8): __gnu_debug
    <a71>   DW_AT_decl_file   : 23
    <a72>   DW_AT_decl_line   : 43
    <a73>   DW_AT_decl_column : 11
    <a74>   DW_AT_sibling     : <0xa81>
 <2><a78>: Abbrev Number: 49 (DW_TAG_imported_module)
    <a79>   DW_AT_decl_file   : 18
    <a7a>   DW_AT_decl_line   : 58
    <a7b>   DW_AT_decl_column : 24
    <a7c>   DW_AT_import      : <0x8e0>	[Abbrev Number: 16 (DW_TAG_namespace)]
 <2><a80>: Abbrev Number: 0
 <1><a81>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a82>   DW_AT_byte_size   : 8
    <a83>   DW_AT_decl_file   : 24
    <a84>   DW_AT_decl_line   : 36
    <a85>   DW_AT_decl_column : 1
    <a85>   DW_AT_linkage_name: (indirect string, offset: 0x69344): 5div_t
    <a89>   DW_AT_sibling     : <0xaa8>
 <2><a8d>: Abbrev Number: 1 (DW_TAG_member)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x55104): quot
    <a92>   DW_AT_decl_file   : 24
    <a93>   DW_AT_decl_line   : 37
    <a94>   DW_AT_decl_column : 7
    <a95>   DW_AT_type        : <0x86>
    <a99>   DW_AT_data_member_location: 0
 <2><a9a>: Abbrev Number: 10 (DW_TAG_member)
    <a9b>   DW_AT_name        : rem
    <a9f>   DW_AT_decl_file   : 24
    <aa0>   DW_AT_decl_line   : 38
    <aa1>   DW_AT_decl_column : 7
    <aa2>   DW_AT_type        : <0x86>
    <aa6>   DW_AT_data_member_location: 4
 <2><aa7>: Abbrev Number: 0
 <1><aa8>: Abbrev Number: 5 (DW_TAG_typedef)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x69345): div_t
    <aad>   DW_AT_decl_file   : 24
    <aae>   DW_AT_decl_line   : 39
    <aaf>   DW_AT_decl_column : 3
    <ab0>   DW_AT_type        : <0xa81>
 <1><ab4>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ab5>   DW_AT_byte_size   : 8
    <ab6>   DW_AT_decl_file   : 24
    <ab7>   DW_AT_decl_line   : 42
    <ab8>   DW_AT_decl_column : 1
    <ab8>   DW_AT_linkage_name: (indirect string, offset: 0x213bf): 6ldiv_t
    <abc>   DW_AT_sibling     : <0xadb>
 <2><ac0>: Abbrev Number: 1 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x55104): quot
    <ac5>   DW_AT_decl_file   : 24
    <ac6>   DW_AT_decl_line   : 43
    <ac7>   DW_AT_decl_column : 8
    <ac8>   DW_AT_type        : <0x5e>
    <acc>   DW_AT_data_member_location: 0
 <2><acd>: Abbrev Number: 10 (DW_TAG_member)
    <ace>   DW_AT_name        : rem
    <ad2>   DW_AT_decl_file   : 24
    <ad3>   DW_AT_decl_line   : 44
    <ad4>   DW_AT_decl_column : 8
    <ad5>   DW_AT_type        : <0x5e>
    <ad9>   DW_AT_data_member_location: 4
 <2><ada>: Abbrev Number: 0
 <1><adb>: Abbrev Number: 5 (DW_TAG_typedef)
    <adc>   DW_AT_name        : (indirect string, offset: 0x213c0): ldiv_t
    <ae0>   DW_AT_decl_file   : 24
    <ae1>   DW_AT_decl_line   : 45
    <ae2>   DW_AT_decl_column : 3
    <ae3>   DW_AT_type        : <0xab4>
 <1><ae7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ae8>   DW_AT_byte_size   : 16
    <ae9>   DW_AT_decl_file   : 24
    <aea>   DW_AT_decl_line   : 49
    <aeb>   DW_AT_decl_column : 1
    <aeb>   DW_AT_linkage_name: (indirect string, offset: 0x7e91d): 7lldiv_t
    <aef>   DW_AT_sibling     : <0xb0e>
 <2><af3>: Abbrev Number: 1 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0x55104): quot
    <af8>   DW_AT_decl_file   : 24
    <af9>   DW_AT_decl_line   : 50
    <afa>   DW_AT_decl_column : 17
    <afb>   DW_AT_type        : <0x78>
    <aff>   DW_AT_data_member_location: 0
 <2><b00>: Abbrev Number: 10 (DW_TAG_member)
    <b01>   DW_AT_name        : rem
    <b05>   DW_AT_decl_file   : 24
    <b06>   DW_AT_decl_line   : 51
    <b07>   DW_AT_decl_column : 17
    <b08>   DW_AT_type        : <0x78>
    <b0c>   DW_AT_data_member_location: 8
 <2><b0d>: Abbrev Number: 0
 <1><b0e>: Abbrev Number: 5 (DW_TAG_typedef)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x7e91e): lldiv_t
    <b13>   DW_AT_decl_file   : 24
    <b14>   DW_AT_decl_line   : 52
    <b15>   DW_AT_decl_column : 3
    <b16>   DW_AT_type        : <0xae7>
 <1><b1a>: Abbrev Number: 5 (DW_TAG_typedef)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x677a1): __compar_fn_t
    <b1f>   DW_AT_decl_file   : 24
    <b20>   DW_AT_decl_line   : 57
    <b21>   DW_AT_decl_column : 15
    <b22>   DW_AT_type        : <0xb26>
 <1><b26>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b27>   DW_AT_byte_size   : 4
    <b27>   DW_AT_type        : <0xb2b>
 <1><b2b>: Abbrev Number: 50 (DW_TAG_subroutine_type)
    <b2c>   DW_AT_type        : <0x86>
    <b30>   DW_AT_sibling     : <0xb3f>
 <2><b34>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b35>   DW_AT_type        : <0x9ed>
 <2><b39>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b3a>   DW_AT_type        : <0x9ed>
 <2><b3e>: Abbrev Number: 0
 <1><b3f>: Abbrev Number: 8 (DW_TAG_subprogram)
    <b40>   DW_AT_external    : 1
    <b40>   DW_AT_name        : (indirect string, offset: 0x7053e): atexit
    <b44>   DW_AT_decl_file   : 24
    <b44>   DW_AT_decl_line   : 76
    <b45>   DW_AT_decl_column : 5
    <b46>   DW_AT_type        : <0x86>
    <b4a>   DW_AT_declaration : 1
    <b4a>   DW_AT_sibling     : <0xb54>
 <2><b4e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b4f>   DW_AT_type        : <0xe1>
 <2><b53>: Abbrev Number: 0
 <1><b54>: Abbrev Number: 8 (DW_TAG_subprogram)
    <b55>   DW_AT_external    : 1
    <b55>   DW_AT_name        : (indirect string, offset: 0x4f4cf): atof
    <b59>   DW_AT_decl_file   : 24
    <b59>   DW_AT_decl_line   : 77
    <b5a>   DW_AT_decl_column : 8
    <b5b>   DW_AT_type        : <0x9fe>
    <b5f>   DW_AT_declaration : 1
    <b5f>   DW_AT_sibling     : <0xb69>
 <2><b63>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b64>   DW_AT_type        : <0xf8>
 <2><b68>: Abbrev Number: 0
 <1><b69>: Abbrev Number: 8 (DW_TAG_subprogram)
    <b6a>   DW_AT_external    : 1
    <b6a>   DW_AT_name        : (indirect string, offset: 0x4f534): atoi
    <b6e>   DW_AT_decl_file   : 24
    <b6e>   DW_AT_decl_line   : 81
    <b6f>   DW_AT_decl_column : 5
    <b70>   DW_AT_type        : <0x86>
    <b74>   DW_AT_declaration : 1
    <b74>   DW_AT_sibling     : <0xb7e>
 <2><b78>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b79>   DW_AT_type        : <0xf8>
 <2><b7d>: Abbrev Number: 0
 <1><b7e>: Abbrev Number: 8 (DW_TAG_subprogram)
    <b7f>   DW_AT_external    : 1
    <b7f>   DW_AT_name        : (indirect string, offset: 0x4f55d): atol
    <b83>   DW_AT_decl_file   : 24
    <b83>   DW_AT_decl_line   : 83
    <b84>   DW_AT_decl_column : 6
    <b85>   DW_AT_type        : <0x5e>
    <b89>   DW_AT_declaration : 1
    <b89>   DW_AT_sibling     : <0xb93>
 <2><b8d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b8e>   DW_AT_type        : <0xf8>
 <2><b92>: Abbrev Number: 0
 <1><b93>: Abbrev Number: 8 (DW_TAG_subprogram)
    <b94>   DW_AT_external    : 1
    <b94>   DW_AT_name        : (indirect string, offset: 0x99974): bsearch
    <b98>   DW_AT_decl_file   : 24
    <b98>   DW_AT_decl_line   : 85
    <b99>   DW_AT_decl_column : 8
    <b9a>   DW_AT_type        : <0xdf>
    <b9e>   DW_AT_declaration : 1
    <b9e>   DW_AT_sibling     : <0xbbc>
 <2><ba2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ba3>   DW_AT_type        : <0x9ed>
 <2><ba7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ba8>   DW_AT_type        : <0x9ed>
 <2><bac>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bad>   DW_AT_type        : <0xc7>
 <2><bb1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bb2>   DW_AT_type        : <0xc7>
 <2><bb6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bb7>   DW_AT_type        : <0xb1a>
 <2><bbb>: Abbrev Number: 0
 <1><bbc>: Abbrev Number: 51 (DW_TAG_subprogram)
    <bbd>   DW_AT_external    : 1
    <bbd>   DW_AT_name        : div
    <bc1>   DW_AT_decl_file   : 24
    <bc2>   DW_AT_decl_line   : 92
    <bc3>   DW_AT_decl_column : 7
    <bc4>   DW_AT_type        : <0xaa8>
    <bc8>   DW_AT_declaration : 1
    <bc8>   DW_AT_sibling     : <0xbd7>
 <2><bcc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bcd>   DW_AT_type        : <0x86>
 <2><bd1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bd2>   DW_AT_type        : <0x86>
 <2><bd6>: Abbrev Number: 0
 <1><bd7>: Abbrev Number: 8 (DW_TAG_subprogram)
    <bd8>   DW_AT_external    : 1
    <bd8>   DW_AT_name        : (indirect string, offset: 0x6e33a): getenv
    <bdc>   DW_AT_decl_file   : 24
    <bdc>   DW_AT_decl_line   : 95
    <bdd>   DW_AT_decl_column : 9
    <bde>   DW_AT_type        : <0xe7>
    <be2>   DW_AT_declaration : 1
    <be2>   DW_AT_sibling     : <0xbec>
 <2><be6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <be7>   DW_AT_type        : <0xf8>
 <2><beb>: Abbrev Number: 0
 <1><bec>: Abbrev Number: 8 (DW_TAG_subprogram)
    <bed>   DW_AT_external    : 1
    <bed>   DW_AT_name        : (indirect string, offset: 0x29e13): ldiv
    <bf1>   DW_AT_decl_file   : 24
    <bf1>   DW_AT_decl_line   : 107
    <bf2>   DW_AT_decl_column : 8
    <bf3>   DW_AT_type        : <0xadb>
    <bf7>   DW_AT_declaration : 1
    <bf7>   DW_AT_sibling     : <0xc06>
 <2><bfb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bfc>   DW_AT_type        : <0x5e>
 <2><c00>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c01>   DW_AT_type        : <0x5e>
 <2><c05>: Abbrev Number: 0
 <1><c06>: Abbrev Number: 8 (DW_TAG_subprogram)
    <c07>   DW_AT_external    : 1
    <c07>   DW_AT_name        : (indirect string, offset: 0x2dc51): mblen
    <c0b>   DW_AT_decl_file   : 24
    <c0b>   DW_AT_decl_line   : 109
    <c0c>   DW_AT_decl_column : 5
    <c0d>   DW_AT_type        : <0x86>
    <c11>   DW_AT_declaration : 1
    <c11>   DW_AT_sibling     : <0xc20>
 <2><c15>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c16>   DW_AT_type        : <0xf8>
 <2><c1a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c1b>   DW_AT_type        : <0xc7>
 <2><c1f>: Abbrev Number: 0
 <1><c20>: Abbrev Number: 8 (DW_TAG_subprogram)
    <c21>   DW_AT_external    : 1
    <c21>   DW_AT_name        : (indirect string, offset: 0xccf6): mbstowcs
    <c25>   DW_AT_decl_file   : 24
    <c25>   DW_AT_decl_line   : 115
    <c26>   DW_AT_decl_column : 8
    <c27>   DW_AT_type        : <0xc7>
    <c2b>   DW_AT_declaration : 1
    <c2b>   DW_AT_sibling     : <0xc3f>
 <2><c2f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c30>   DW_AT_type        : <0xa05>
 <2><c34>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c35>   DW_AT_type        : <0xf8>
 <2><c39>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c3a>   DW_AT_type        : <0xc7>
 <2><c3e>: Abbrev Number: 0
 <1><c3f>: Abbrev Number: 8 (DW_TAG_subprogram)
    <c40>   DW_AT_external    : 1
    <c40>   DW_AT_name        : (indirect string, offset: 0x78581): mbtowc
    <c44>   DW_AT_decl_file   : 24
    <c44>   DW_AT_decl_line   : 111
    <c45>   DW_AT_decl_column : 5
    <c46>   DW_AT_type        : <0x86>
    <c4a>   DW_AT_declaration : 1
    <c4a>   DW_AT_sibling     : <0xc5e>
 <2><c4e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c4f>   DW_AT_type        : <0xa05>
 <2><c53>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c54>   DW_AT_type        : <0xf8>
 <2><c58>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c59>   DW_AT_type        : <0xc7>
 <2><c5d>: Abbrev Number: 0
 <1><c5e>: Abbrev Number: 27 (DW_TAG_subprogram)
    <c5f>   DW_AT_external    : 1
    <c5f>   DW_AT_name        : (indirect string, offset: 0xe8b9): qsort
    <c63>   DW_AT_decl_file   : 24
    <c63>   DW_AT_decl_line   : 143
    <c64>   DW_AT_decl_column : 6
    <c64>   DW_AT_declaration : 1
    <c64>   DW_AT_sibling     : <0xc7d>
 <2><c68>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c69>   DW_AT_type        : <0xdf>
 <2><c6d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c6e>   DW_AT_type        : <0xc7>
 <2><c72>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c73>   DW_AT_type        : <0xc7>
 <2><c77>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c78>   DW_AT_type        : <0xb1a>
 <2><c7c>: Abbrev Number: 0
 <1><c7d>: Abbrev Number: 52 (DW_TAG_subprogram)
    <c7e>   DW_AT_external    : 1
    <c7e>   DW_AT_name        : (indirect string, offset: 0x6179c): rand
    <c82>   DW_AT_decl_file   : 24
    <c83>   DW_AT_decl_line   : 144
    <c84>   DW_AT_decl_column : 5
    <c85>   DW_AT_type        : <0x86>
    <c89>   DW_AT_declaration : 1
 <1><c89>: Abbrev Number: 27 (DW_TAG_subprogram)
    <c8a>   DW_AT_external    : 1
    <c8a>   DW_AT_name        : (indirect string, offset: 0x6179b): srand
    <c8e>   DW_AT_decl_file   : 24
    <c8e>   DW_AT_decl_line   : 159
    <c8f>   DW_AT_decl_column : 6
    <c8f>   DW_AT_declaration : 1
    <c8f>   DW_AT_sibling     : <0xc99>
 <2><c93>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c94>   DW_AT_type        : <0x8d>
 <2><c98>: Abbrev Number: 0
 <1><c99>: Abbrev Number: 8 (DW_TAG_subprogram)
    <c9a>   DW_AT_external    : 1
    <c9a>   DW_AT_name        : (indirect string, offset: 0x46e24): strtod
    <c9e>   DW_AT_decl_file   : 24
    <c9e>   DW_AT_decl_line   : 160
    <c9f>   DW_AT_decl_column : 8
    <ca0>   DW_AT_type        : <0x9fe>
    <ca4>   DW_AT_declaration : 1
    <ca4>   DW_AT_sibling     : <0xcb3>
 <2><ca8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ca9>   DW_AT_type        : <0xf8>
 <2><cad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cae>   DW_AT_type        : <0xcb3>
 <2><cb2>: Abbrev Number: 0
 <1><cb3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <cb4>   DW_AT_byte_size   : 4
    <cb4>   DW_AT_type        : <0xe7>
 <1><cb8>: Abbrev Number: 8 (DW_TAG_subprogram)
    <cb9>   DW_AT_external    : 1
    <cb9>   DW_AT_name        : (indirect string, offset: 0x46ef1): strtol
    <cbd>   DW_AT_decl_file   : 24
    <cbd>   DW_AT_decl_line   : 171
    <cbe>   DW_AT_decl_column : 6
    <cbf>   DW_AT_type        : <0x5e>
    <cc3>   DW_AT_declaration : 1
    <cc3>   DW_AT_sibling     : <0xcd7>
 <2><cc7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cc8>   DW_AT_type        : <0xf8>
 <2><ccc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ccd>   DW_AT_type        : <0xcb3>
 <2><cd1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd2>   DW_AT_type        : <0x86>
 <2><cd6>: Abbrev Number: 0
 <1><cd7>: Abbrev Number: 8 (DW_TAG_subprogram)
    <cd8>   DW_AT_external    : 1
    <cd8>   DW_AT_name        : (indirect string, offset: 0x78095): strtoul
    <cdc>   DW_AT_decl_file   : 24
    <cdc>   DW_AT_decl_line   : 173
    <cdd>   DW_AT_decl_column : 15
    <cde>   DW_AT_type        : <0x71>
    <ce2>   DW_AT_declaration : 1
    <ce2>   DW_AT_sibling     : <0xcf6>
 <2><ce6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ce7>   DW_AT_type        : <0xf8>
 <2><ceb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cec>   DW_AT_type        : <0xcb3>
 <2><cf0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cf1>   DW_AT_type        : <0x86>
 <2><cf5>: Abbrev Number: 0
 <1><cf6>: Abbrev Number: 8 (DW_TAG_subprogram)
    <cf7>   DW_AT_external    : 1
    <cf7>   DW_AT_name        : (indirect string, offset: 0x225dc): system
    <cfb>   DW_AT_decl_file   : 24
    <cfb>   DW_AT_decl_line   : 191
    <cfc>   DW_AT_decl_column : 5
    <cfd>   DW_AT_type        : <0x86>
    <d01>   DW_AT_declaration : 1
    <d01>   DW_AT_sibling     : <0xd0b>
 <2><d05>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d06>   DW_AT_type        : <0xf8>
 <2><d0a>: Abbrev Number: 0
 <1><d0b>: Abbrev Number: 8 (DW_TAG_subprogram)
    <d0c>   DW_AT_external    : 1
    <d0c>   DW_AT_name        : (indirect string, offset: 0x97cc1): wcstombs
    <d10>   DW_AT_decl_file   : 24
    <d10>   DW_AT_decl_line   : 117
    <d11>   DW_AT_decl_column : 8
    <d12>   DW_AT_type        : <0xc7>
    <d16>   DW_AT_declaration : 1
    <d16>   DW_AT_sibling     : <0xd2a>
 <2><d1a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d1b>   DW_AT_type        : <0xe7>
 <2><d1f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d20>   DW_AT_type        : <0xd2a>
 <2><d24>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d25>   DW_AT_type        : <0xc7>
 <2><d29>: Abbrev Number: 0
 <1><d2a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d2b>   DW_AT_byte_size   : 4
    <d2b>   DW_AT_type        : <0x9d2>
 <1><d2f>: Abbrev Number: 8 (DW_TAG_subprogram)
    <d30>   DW_AT_external    : 1
    <d30>   DW_AT_name        : (indirect string, offset: 0x4cc9a): wctomb
    <d34>   DW_AT_decl_file   : 24
    <d34>   DW_AT_decl_line   : 113
    <d35>   DW_AT_decl_column : 5
    <d36>   DW_AT_type        : <0x86>
    <d3a>   DW_AT_declaration : 1
    <d3a>   DW_AT_sibling     : <0xd49>
 <2><d3e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d3f>   DW_AT_type        : <0xe7>
 <2><d43>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d44>   DW_AT_type        : <0x9cb>
 <2><d48>: Abbrev Number: 0
 <1><d49>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d4a>   DW_AT_external    : 1
    <d4a>   DW_AT_name        : (indirect string, offset: 0x29e12): lldiv
    <d4e>   DW_AT_decl_file   : 24
    <d4e>   DW_AT_decl_line   : 268
    <d50>   DW_AT_decl_column : 9
    <d51>   DW_AT_type        : <0xb0e>
    <d55>   DW_AT_declaration : 1
    <d55>   DW_AT_sibling     : <0xd64>
 <2><d59>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5a>   DW_AT_type        : <0x78>
 <2><d5e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d5f>   DW_AT_type        : <0x78>
 <2><d63>: Abbrev Number: 0
 <1><d64>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d65>   DW_AT_external    : 1
    <d65>   DW_AT_name        : (indirect string, offset: 0x1d4d8): atoll
    <d69>   DW_AT_decl_file   : 24
    <d69>   DW_AT_decl_line   : 263
    <d6b>   DW_AT_decl_column : 11
    <d6c>   DW_AT_type        : <0x78>
    <d70>   DW_AT_declaration : 1
    <d70>   DW_AT_sibling     : <0xd7a>
 <2><d74>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d75>   DW_AT_type        : <0xf8>
 <2><d79>: Abbrev Number: 0
 <1><d7a>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d7b>   DW_AT_external    : 1
    <d7b>   DW_AT_name        : (indirect string, offset: 0x83c8): strtoll
    <d7f>   DW_AT_decl_file   : 24
    <d7f>   DW_AT_decl_line   : 269
    <d81>   DW_AT_decl_column : 11
    <d82>   DW_AT_type        : <0x78>
    <d86>   DW_AT_declaration : 1
    <d86>   DW_AT_sibling     : <0xd9a>
 <2><d8a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8b>   DW_AT_type        : <0xf8>
 <2><d8f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90>   DW_AT_type        : <0xcb3>
 <2><d94>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d95>   DW_AT_type        : <0x86>
 <2><d99>: Abbrev Number: 0
 <1><d9a>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d9b>   DW_AT_external    : 1
    <d9b>   DW_AT_name        : (indirect string, offset: 0x81581): strtoull
    <d9f>   DW_AT_decl_file   : 24
    <d9f>   DW_AT_decl_line   : 273
    <da1>   DW_AT_decl_column : 20
    <da2>   DW_AT_type        : <0x7f>
    <da6>   DW_AT_declaration : 1
    <da6>   DW_AT_sibling     : <0xdba>
 <2><daa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dab>   DW_AT_type        : <0xf8>
 <2><daf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <db0>   DW_AT_type        : <0xcb3>
 <2><db4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <db5>   DW_AT_type        : <0x86>
 <2><db9>: Abbrev Number: 0
 <1><dba>: Abbrev Number: 8 (DW_TAG_subprogram)
    <dbb>   DW_AT_external    : 1
    <dbb>   DW_AT_name        : (indirect string, offset: 0x5c068): strtof
    <dbf>   DW_AT_decl_file   : 24
    <dbf>   DW_AT_decl_line   : 163
    <dc0>   DW_AT_decl_column : 7
    <dc1>   DW_AT_type        : <0x9f2>
    <dc5>   DW_AT_declaration : 1
    <dc5>   DW_AT_sibling     : <0xdd4>
 <2><dc9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dca>   DW_AT_type        : <0xf8>
 <2><dce>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dcf>   DW_AT_type        : <0xcb3>
 <2><dd3>: Abbrev Number: 0
 <1><dd4>: Abbrev Number: 19 (DW_TAG_subprogram)
    <dd5>   DW_AT_external    : 1
    <dd5>   DW_AT_name        : (indirect string, offset: 0x75307): strtold
    <dd9>   DW_AT_decl_file   : 24
    <dd9>   DW_AT_decl_line   : 324
    <ddb>   DW_AT_decl_column : 20
    <ddc>   DW_AT_type        : <0xd3>
    <de0>   DW_AT_declaration : 1
    <de0>   DW_AT_sibling     : <0xdef>
 <2><de4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <de5>   DW_AT_type        : <0xf8>
 <2><de9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dea>   DW_AT_type        : <0xcb3>
 <2><dee>: Abbrev Number: 0
 <1><def>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <df0>   DW_AT_byte_size   : 4
    <df0>   DW_AT_type        : <0x827>
 <1><df4>: Abbrev Number: 18 (DW_TAG_namespace)
    <df5>   DW_AT_name        : (indirect string, offset: 0x2ed8c): System_serial
    <df9>   DW_AT_decl_file   : 25
    <dfa>   DW_AT_decl_line   : 38
    <dfb>   DW_AT_decl_column : 11
    <dfc>   DW_AT_sibling     : <0xed5>
 <2><e00>: Abbrev Number: 22 (DW_TAG_class_type)
    <e01>   DW_AT_name        : (indirect string, offset: 0x2ed93): serial
    <e05>   DW_AT_byte_size   : 4
    <e05>   DW_AT_decl_file   : 25
    <e06>   DW_AT_decl_line   : 40
    <e07>   DW_AT_decl_column : 7
 <3><e08>: Abbrev Number: 17 (DW_TAG_subprogram)
    <e09>   DW_AT_external    : 1
    <e09>   DW_AT_name        : (indirect string, offset: 0x2ed93): serial
    <e0d>   DW_AT_decl_file   : 25
    <e0e>   DW_AT_decl_line   : 42
    <e0f>   DW_AT_decl_column : 2
    <e10>   DW_AT_linkage_name: (indirect string, offset: 0x8ae): _ZN13System_serial6serialC4EP20__UART_HandleTypeDef
    <e14>   DW_AT_type        : <0xed5>
    <e18>   DW_AT_accessibility: 1	(public)
    <e18>   DW_AT_declaration : 1
    <e18>   DW_AT_object_pointer: <0xe20>
    <e1c>   DW_AT_sibling     : <0xe2b>
 <4><e20>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e21>   DW_AT_type        : <0xed5>
    <e25>   DW_AT_artificial  : 1
 <4><e25>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e26>   DW_AT_type        : <0xdef>
 <4><e2a>: Abbrev Number: 0
 <3><e2b>: Abbrev Number: 20 (DW_TAG_subprogram)
    <e2c>   DW_AT_external    : 1
    <e2c>   DW_AT_name        : (indirect string, offset: 0x3edc5): TransmitData
    <e30>   DW_AT_decl_file   : 25
    <e30>   DW_AT_decl_line   : 43
    <e31>   DW_AT_decl_column : 10
    <e31>   DW_AT_linkage_name: (indirect string, offset: 0x981d4): _ZN13System_serial6serial12TransmitDataEPKhtm
    <e35>   DW_AT_accessibility: 1	(public)
    <e35>   DW_AT_declaration : 1
    <e35>   DW_AT_object_pointer: <0xe3d>
    <e39>   DW_AT_sibling     : <0xe52>
 <4><e3d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e3e>   DW_AT_type        : <0xed5>
    <e42>   DW_AT_artificial  : 1
 <4><e42>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e43>   DW_AT_type        : <0x81d>
 <4><e47>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e48>   DW_AT_type        : <0xa5>
 <4><e4c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e4d>   DW_AT_type        : <0xb6>
 <4><e51>: Abbrev Number: 0
 <3><e52>: Abbrev Number: 20 (DW_TAG_subprogram)
    <e53>   DW_AT_external    : 1
    <e53>   DW_AT_name        : (indirect string, offset: 0x36350): RxintEn
    <e57>   DW_AT_decl_file   : 25
    <e57>   DW_AT_decl_line   : 44
    <e58>   DW_AT_decl_column : 10
    <e58>   DW_AT_linkage_name: (indirect string, offset: 0x33805): _ZN13System_serial6serial7RxintEnEPht
    <e5c>   DW_AT_accessibility: 1	(public)
    <e5c>   DW_AT_declaration : 1
    <e5c>   DW_AT_object_pointer: <0xe64>
    <e60>   DW_AT_sibling     : <0xe74>
 <4><e64>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e65>   DW_AT_type        : <0xed5>
    <e69>   DW_AT_artificial  : 1
 <4><e69>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e6a>   DW_AT_type        : <0x822>
 <4><e6e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e6f>   DW_AT_type        : <0xa5>
 <4><e73>: Abbrev Number: 0
 <3><e74>: Abbrev Number: 20 (DW_TAG_subprogram)
    <e75>   DW_AT_external    : 1
    <e75>   DW_AT_name        : (indirect string, offset: 0x40b92): TxintEn
    <e79>   DW_AT_decl_file   : 25
    <e79>   DW_AT_decl_line   : 45
    <e7a>   DW_AT_decl_column : 10
    <e7a>   DW_AT_linkage_name: (indirect string, offset: 0x2d0b6): _ZN13System_serial6serial7TxintEnEPht
    <e7e>   DW_AT_accessibility: 1	(public)
    <e7e>   DW_AT_declaration : 1
    <e7e>   DW_AT_object_pointer: <0xe86>
    <e82>   DW_AT_sibling     : <0xe96>
 <4><e86>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e87>   DW_AT_type        : <0xed5>
    <e8b>   DW_AT_artificial  : 1
 <4><e8b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e8c>   DW_AT_type        : <0x822>
 <4><e90>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e91>   DW_AT_type        : <0xa5>
 <4><e95>: Abbrev Number: 0
 <3><e96>: Abbrev Number: 20 (DW_TAG_subprogram)
    <e97>   DW_AT_external    : 1
    <e97>   DW_AT_name        : (indirect string, offset: 0x3d38a): RxintDis
    <e9b>   DW_AT_decl_file   : 25
    <e9b>   DW_AT_decl_line   : 46
    <e9c>   DW_AT_decl_column : 10
    <e9c>   DW_AT_linkage_name: (indirect string, offset: 0x5d886): _ZN13System_serial6serial8RxintDisEv
    <ea0>   DW_AT_accessibility: 1	(public)
    <ea0>   DW_AT_declaration : 1
    <ea0>   DW_AT_object_pointer: <0xea8>
    <ea4>   DW_AT_sibling     : <0xeae>
 <4><ea8>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ea9>   DW_AT_type        : <0xed5>
    <ead>   DW_AT_artificial  : 1
 <4><ead>: Abbrev Number: 0
 <3><eae>: Abbrev Number: 20 (DW_TAG_subprogram)
    <eaf>   DW_AT_external    : 1
    <eaf>   DW_AT_name        : (indirect string, offset: 0x39242): TxintDis
    <eb3>   DW_AT_decl_file   : 25
    <eb3>   DW_AT_decl_line   : 47
    <eb4>   DW_AT_decl_column : 10
    <eb4>   DW_AT_linkage_name: (indirect string, offset: 0x5c288): _ZN13System_serial6serial8TxintDisEv
    <eb8>   DW_AT_accessibility: 1	(public)
    <eb8>   DW_AT_declaration : 1
    <eb8>   DW_AT_object_pointer: <0xec0>
    <ebc>   DW_AT_sibling     : <0xec6>
 <4><ec0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ec1>   DW_AT_type        : <0xed5>
    <ec5>   DW_AT_artificial  : 1
 <4><ec5>: Abbrev Number: 0
 <3><ec6>: Abbrev Number: 1 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x2f678): Internal_UartHandler
    <ecb>   DW_AT_decl_file   : 25
    <ecc>   DW_AT_decl_line   : 51
    <ecd>   DW_AT_decl_column : 27
    <ece>   DW_AT_type        : <0xdef>
    <ed2>   DW_AT_data_member_location: 0
 <3><ed3>: Abbrev Number: 0
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ed6>   DW_AT_byte_size   : 4
    <ed6>   DW_AT_type        : <0xe00>
 <1><eda>: Abbrev Number: 53 (DW_TAG_namespace)
    <edb>   DW_AT_name        : HMI
    <edf>   DW_AT_decl_file   : 26
    <ee0>   DW_AT_decl_line   : 14
    <ee1>   DW_AT_decl_column : 11
    <ee2>   DW_AT_sibling     : <0x1015>
 <2><ee6>: Abbrev Number: 22 (DW_TAG_class_type)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x12b86): DWIN
    <eeb>   DW_AT_byte_size   : 4
    <eeb>   DW_AT_decl_file   : 26
    <eec>   DW_AT_decl_line   : 16
    <eed>   DW_AT_decl_column : 7
 <3><eee>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <eef>   DW_AT_name        : (indirect string, offset: 0xab363): status
    <ef3>   DW_AT_encoding    : 7	(unsigned)
    <ef3>   DW_AT_byte_size   : 1
    <ef3>   DW_AT_type        : <0x3d>
    <ef7>   DW_AT_decl_file   : 26
    <ef8>   DW_AT_decl_line   : 19
    <ef9>   DW_AT_decl_column : 7
    <efa>   DW_AT_accessibility: 1	(public)
    <efa>   DW_AT_sibling     : <0xf0b>
 <4><efe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <eff>   DW_AT_name        : (indirect string, offset: 0xc1c2): DWIN_OK
    <f03>   DW_AT_const_value : 0
 <4><f04>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f05>   DW_AT_name        : (indirect string, offset: 0x7fcd5): DWIN_ERR
    <f09>   DW_AT_const_value : 1
 <4><f0a>: Abbrev Number: 0
 <3><f0b>: Abbrev Number: 28 (DW_TAG_subprogram)
    <f0c>   DW_AT_external    : 1
    <f0c>   DW_AT_name        : (indirect string, offset: 0x12b86): DWIN
    <f10>   DW_AT_decl_file   : 26
    <f11>   DW_AT_decl_line   : 40
    <f12>   DW_AT_decl_column : 5
    <f13>   DW_AT_linkage_name: (indirect string, offset: 0x6c9ef): _ZN3HMI4DWINC4EP20__UART_HandleTypeDef
    <f17>   DW_AT_type        : <0x1015>
    <f1b>   DW_AT_accessibility: 1	(public)
    <f1b>   DW_AT_declaration : 1
    <f1b>   DW_AT_object_pointer: <0xf23>
    <f1f>   DW_AT_inline      : 0	(not inlined)
    <f1f>   DW_AT_sibling     : <0xf2e>
 <4><f23>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f24>   DW_AT_type        : <0x1015>
    <f28>   DW_AT_artificial  : 1
 <4><f28>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f29>   DW_AT_type        : <0xdef>
 <4><f2d>: Abbrev Number: 0
 <3><f2e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <f2f>   DW_AT_external    : 1
    <f2f>   DW_AT_name        : (indirect string, offset: 0x2fd46): SendTankData
    <f33>   DW_AT_decl_file   : 26
    <f34>   DW_AT_decl_line   : 41
    <f35>   DW_AT_decl_column : 14
    <f36>   DW_AT_linkage_name: (indirect string, offset: 0x5247d): _ZN3HMI4DWIN12SendTankDataEtt
    <f3a>   DW_AT_type        : <0xeee>
    <f3e>   DW_AT_accessibility: 1	(public)
    <f3e>   DW_AT_declaration : 1
    <f3e>   DW_AT_object_pointer: <0xf46>
    <f42>   DW_AT_sibling     : <0xf56>
 <4><f46>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f47>   DW_AT_type        : <0x1015>
    <f4b>   DW_AT_artificial  : 1
 <4><f4b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4c>   DW_AT_type        : <0xa5>
 <4><f50>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f51>   DW_AT_type        : <0xa5>
 <4><f55>: Abbrev Number: 0
 <3><f56>: Abbrev Number: 17 (DW_TAG_subprogram)
    <f57>   DW_AT_external    : 1
    <f57>   DW_AT_name        : (indirect string, offset: 0x77e01): SendTimeDateData
    <f5b>   DW_AT_decl_file   : 26
    <f5c>   DW_AT_decl_line   : 42
    <f5d>   DW_AT_decl_column : 14
    <f5e>   DW_AT_linkage_name: (indirect string, offset: 0x83346): _ZN3HMI4DWIN16SendTimeDateDataEttPcS1_
    <f62>   DW_AT_type        : <0xeee>
    <f66>   DW_AT_accessibility: 1	(public)
    <f66>   DW_AT_declaration : 1
    <f66>   DW_AT_object_pointer: <0xf6e>
    <f6a>   DW_AT_sibling     : <0xf88>
 <4><f6e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f6f>   DW_AT_type        : <0x1015>
    <f73>   DW_AT_artificial  : 1
 <4><f73>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f74>   DW_AT_type        : <0xa5>
 <4><f78>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f79>   DW_AT_type        : <0xa5>
 <4><f7d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f7e>   DW_AT_type        : <0xe7>
 <4><f82>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f83>   DW_AT_type        : <0xe7>
 <4><f87>: Abbrev Number: 0
 <3><f88>: Abbrev Number: 17 (DW_TAG_subprogram)
    <f89>   DW_AT_external    : 1
    <f89>   DW_AT_name        : (indirect string, offset: 0x60b12): SendNetworkData
    <f8d>   DW_AT_decl_file   : 26
    <f8e>   DW_AT_decl_line   : 43
    <f8f>   DW_AT_decl_column : 17
    <f90>   DW_AT_linkage_name: (indirect string, offset: 0x2535): _ZN3HMI4DWIN15SendNetworkDataEtPc
    <f94>   DW_AT_type        : <0xeee>
    <f98>   DW_AT_accessibility: 1	(public)
    <f98>   DW_AT_declaration : 1
    <f98>   DW_AT_object_pointer: <0xfa0>
    <f9c>   DW_AT_sibling     : <0xfb0>
 <4><fa0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <fa1>   DW_AT_type        : <0x1015>
    <fa5>   DW_AT_artificial  : 1
 <4><fa5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <fa6>   DW_AT_type        : <0xa5>
 <4><faa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <fab>   DW_AT_type        : <0xe7>
 <4><faf>: Abbrev Number: 0
 <3><fb0>: Abbrev Number: 17 (DW_TAG_subprogram)
    <fb1>   DW_AT_external    : 1
    <fb1>   DW_AT_name        : (indirect string, offset: 0xc44): SendNetworkQuality
    <fb5>   DW_AT_decl_file   : 26
    <fb6>   DW_AT_decl_line   : 44
    <fb7>   DW_AT_decl_column : 17
    <fb8>   DW_AT_linkage_name: (indirect string, offset: 0x935af): _ZN3HMI4DWIN18SendNetworkQualityEtPc
    <fbc>   DW_AT_type        : <0xeee>
    <fc0>   DW_AT_accessibility: 1	(public)
    <fc0>   DW_AT_declaration : 1
    <fc0>   DW_AT_object_pointer: <0xfc8>
    <fc4>   DW_AT_sibling     : <0xfd8>
 <4><fc8>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <fc9>   DW_AT_type        : <0x1015>
    <fcd>   DW_AT_artificial  : 1
 <4><fcd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <fce>   DW_AT_type        : <0xa5>
 <4><fd2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <fd3>   DW_AT_type        : <0xe7>
